[
  {
    "headline": "Sir Benegal Narsing Rau- An Anniversary Tribute",
    "data": "We celebrated Constitution Day on November 26. The role and contribution of B.N.Rau in the making of our Constitution is marvellous. The 70th anniversary of his passing is on November 30. It is only appropriate that we remember his life and work and salute his sacred memory.To pay tribute to B.N. Rau, “is to paint the lily, to gild refined gold and throw a perfume on the jasmine,” for so exemplary was the man in his personal and functional qualities and accomplishments.Sir Benegal Narsing Rau was born in Mangalore on February 26, 1887. He hailed from a distinguished family rich in the gifts of intellect and attainments. Narsing Rau had a brilliant academic career. He was educated at Canara High School, Mangalore from where he matriculated topping the list of students in the entire Madras Presidency. He joined the Presidency College, Madras and obtained from the Madras University a triple first class in English, Physics and Sanskrit in 1905 and a first class in Mathematics the following year and won all the prizes and medals. Thereafter he studied at Trinity College, Cambridge where Jawaharlal Nehru was a contemporary. He took his Mathematics Tripos in 1909. He qualified for the Indian Civil Service and joined service in 1910 and was allotted to the Bengal cadre.After some time he preferred to serve as a judicial officer and soon began what was to be a very distinguished career in legal work. He was a District and Sessions Judge from 1919 to 1923. Then he did legal work for the Government of India on various Committees and Commissions and acted as Reforms Commissioner in 1928. He served as Secretary to the Legislative Council and as Legal Remembrancer in Assam. He presented Assam’s case to the Joint Select Committee of the British Parliament in London in 1933. The Governor of Assam requested him to prepare a note on the principle of election to the Council of States by the single transferable vote. Having regard to his deep knowledge and great familiarity with constitutional law and affairs, his assistance was sought in connection with the working of the Government of India Act, 1935. He had by then established himself as an expert in constitutional law. The 1935 Act repealed the Government of India Act, 1919, but it provided for continuance of the laws in force in British India immediately prior thereto and adaptation and modification thereof as was necessary and expedient. It provided B.N.Rau the major opportunity for creative legal work. He was entrusted with the work of reviewing all existing laws and suggesting the necessary adaptations and modifications. He was the principal draftsman of the Government of India (Adaptation of Indian Laws) Order, 1937. It covered 469 printed pages and thousands of provisions of laws which were adapted or modified. It has been the model for all subsequent adaptations. It demonstrated the ‘enormous industry, the meticulous knowledge of the law of the land and the high standards of draftsmanship with which the work was accomplished.’ His legal career culminated in his appointment as a judge of the Calcutta High Court, first as a temporary judge on 2nd April, 1935 and then as a permanent judge on 16th January, 1939 and he demitted office on 1st February, 1944. He rendered many important judgments while in the Calcutta High Court. Reference may be made to G.P. Stewart v. Brojendra Kishore Roy Choudhary, AIR 1939 Cal 628, in which he elucidated the test of repugnancy with great lucidity of thought and felicity of language. This has been referred to with approval by the Supreme Court in Tika Ramji v. State of Uttar Pradesh, AIR 1956 SC 676. This one instance by itself shows what contribution he would have made to the development of our constitutional law if he had been elevated to the Federal Court as originally planned by Chief Justice Maurice Gwyer. That was not to be. And instead of being an interpreter, he became the creator of constitutional law. During this period B.N. Rau undertook the work of wage adjudication under the Trade Disputes Act, 1929. This was in connection with a dispute raised by the employees of the Great Indian Peninsular Railway regarding payment of dearness allowance and other conditions of their service. The Rau Court of Enquiry submitted its report in 1940 justifying the claim for payment of dearness allowance. Pursuant to the Report, Government started supplying essential articles to its employees at concessional rates and this had the effect of neutralising greatly the rise in prices. Sir Benegal was a pathfinder in the ever growing and complex area of labour relations. While he was a judge of the Calcutta High Court B.N. Rau was appointed Chairman of the Indus Commission with two Chief Engineers as its members to look into the rights of the various provinces to an equitable distribution of the waters. This was under section 131 of the Government of India Act, 1935 on a representation by Sind. The Commission formulated the principles relating to distribution of river water amongst riparian states or regions. These principles have become a model for several subsequent Commissions appointed to decide similar disputes. It has been said that the work of Justice B.N. Rau heading that Commission provided ‘an illustration of the untiring industry, thoroughness and impartiality with which he tackled every problem …. The report … has been regarded, not only in India, but outside, as a classic on riparian rights, covering the subject with great legal knowledge and technical accuracy.’ B.N. Rau was the Prime Minister of Kashmir in 1944-45. He was also the sole arbitrator in a dispute between the Reserve Bank of India and the Central Provinces relating to some rioting and carrying away of currency chests in 1942 and as to who should bear the loss thus incurred. During that period he also headed the Committee for reform of the Hindu personal law- The Hindu Law Reform Committee. The Committee submitted its report and drew up a draft code which eventually resulted in various enactments by Parliament in 1955-1956. He also dealt with the boundary dispute between Madras and Orissa and his report formed the basis of the Madras-Orissa Agreement, 1946 on the Machkund Hydel Project. It is of interest to note that B.N. Rau was also one of the important persons who chalked out the line of defence in the famous Indian National Army (INA) trial. His deep knowledge of International Law was of great help in evolving an interesting theory for the defence which was put forth with commendable clarity and force by Bhulabhai Desai as lead counsel for the defence. That theory was that according to the established principles of International Law the accused were entitled to take up arms under the aegis of a provisional Government headed by Subhash Chandra Bose in order to gain the freedom of the country and the acts done by them in their capacity as members of such an organised force could not be offences under the municipal law of India. Rau returned to the Reforms Office of the Government of India as an Officer on Special Duty where he served until his appointment as the Constitutional Adviser to the Constituent Assembly in July, 1946. This was his crowning glory! It may be mentioned that when he was again offered judgeship of the Calcutta High Court in 1945, B.N. Rau declined the offer and opted to stay on and work until the Constitution and the Federation were accomplished. His response to the Viceroy’s Private Secretary is typical of the man: If personal prospects were all, a decision would have been easy; but I have now reached a stage in my official life when they ought to cease to count, and I have therefore to look at the matter from another point of view. The big thing before India is now Federation. I have spent, off and on, over a dozen years in the study of constitutional law in general and the Indian Constitution in particular; and within the limits permitted to me, I have had some share in the working out of the details of the federal scheme now taking shape. If, therefore, I have any choice, I should like to stay on here until Federation, in whatever form it ultimately comes, is an accomplished fact. This will mean the abandonment of any prospects in the High Court, or anywhere else via the High Court, but such things are inevitable.His role in the making of India’s Constitution was seminal. He brought to his work his brilliance and rich experience. He prepared the first draft which was the basis for discussion. That draft had marginal notes of reference to the different constitutions. He worked honorarily all the time he was with the Constituent Assembly. As Setalvad said the Constituent Assembly could enter upon its arduous task only on the basis of a draft prepared by B.N. Rau after deep study and laborious research. He drew the plan and outlined the foundation of the noble structure. While his work and contribution in all fields of his endeavour have been great, it is Sir Benegal’s work in the making of our Constitution that is truly splendid. He was an eminent lawyer and judge well versed in law and constitutional history. His knowledge was wide and deep. Dr. Rajendra Prasad said that ‘by knowledge, experience and natural gifts he was the inevitable choice for the post of Constitutional Adviser and that he was ‘guide, philosopher and friend’ in a task of such supreme national importance as the framing of the Constitution. ….He assisted the Assembly not only with his knowledge and erudition but also enabled the other members to perform their duties with thoroughness and intelligence by supplying them with the material on which they could work.’ If Dr. Ambedkar was the skilful pilot of the Constitution through all its different stages, Sir B.N. Rau was the person who visualised the plan and laid its foundation. He was superb in draftsmanship, endowed with a style which was at once clear, illuminating and precise- qualities which are indispensable in any document of legal or constitutional importance. While functioning as Constitutional Adviser, B.N. Rau was also Adviser to the Government of Burma in connection with the drafting of their Constitution in 1947. In October 1947 Rau went to U.S.A, Canada, Ireland and U.K. for personal discussions with leading constitutional authorities there. The tour led to fruitful contacts and deliberations. Amongst others, he met and discussed with Justice Hughes, former Chief Justice of the U.S. Supreme Court and Justices Frankfurter, Burton and Murphy; Judge Learned Hand, Justice Thorsen of Canada and the Irish Foreign Minister – Boland. The Directive Principles of State Policy were borrowed from the Irish Constitution. Sir Benegal noted that modern constitutions contained such moral precepts which have educative value but he wanted the directive principles to go beyond the level of precepts. The “Due Process” clause was not included in the Constitution as a result of his discussions with Justice Frankfurter. However, by accepting the amendment proposed by Thakurdas Bhargava incorporating ‘reasonable’ and ensuring that the restrictions imposed on various guaranteed freedoms are reasonable in the view of the courts, almost the same result has been achieved. It is a different matter that Sir Benegal’s views and his proposals regarding Governors and the appointment of judges of the Supreme Court and the High Courts were different and the Constituent Assembly did not adopt them.Justice Frankfurter wrote to Sir Benegal: “My talks with you were among the pleasantest and most satisfying experiences in Washington.’’ And even more, Frankfurter was so impressed that he remarked, “If the President of the USA were to ask me to recommend a judge for our Supreme Court on the strength of his knowledge of the history and working of the American Constitution, B.N. Rau would be the first on my list.” Great praise from high authority and very well deserved! No compliment could have been higher. He was one of the members of the Adhoc Committee of the Constituent Assembly headed by Sir Varadachariar, set up to decide the constitution and powers of the Supreme Court. The other members were K.M. Munshi, N.G. Ayyangar and B.L. Mitter. His advice in the matter of introduction in the Constitution of the power of judicial review is interesting and noteworthy. ‘The courts manned by an irremovable judiciary not so sensitive to public needs in the social or economic sphere as the representatives of the periodically elected legislative body, will, in effect, have a veto on legislation exercisable at any time and at the instance of any litigant. The compensating advantages, particularly the security which would be felt by the citizens generally and the religious minorities, are also pointed out. He quotes from Lauterpacht how, in the United States, the doctrine of judicial review after one hundred and forty years of operation had the unqualified support of a large-perhaps, predominant-section of American legal opinion as a bulwark of the liberty of the people against the rashness and the tyranny of the short-lived legislative majorities.’His views as regards the powers of the President under the Constitution are of equal interest and significance. “One can conceive of no better future for the President of India than that he should be more and more like the monarch in England, eschewing legal power, standing outside the clash of parties and gaining in moral authority.” The same view was also echoed by the Supreme Court in Samsher Singh v. State of Punjab, AIR 1974 SC 2192.B.N. Rau was in the Indian delegation to the United Nations in 1948. Later in 1949-1951 he was India’s Permanent Representative to the UNO and handled many delicate matters such as the Kashmir dispute and the Hyderabad issue. When India was elected as a member of the Security Council, Rau represented India on it and participated in discussions on a variety of issues. Again his familiarity with and expertise in International Law were of great help to the delegation. Setalvad who also was in the delegation speaks of this. Sir Benegal did remarkable work at the U.N. also. It was again B.N. Rau who was mainly responsible for evolving a formula by which India could remain in the Commonwealth while becoming a republic. While being part of the Indian delegation to the UN, Rau had to return to India to prepare important papers for the Constituent Assembly. His name had also been put forward for election to the World Court and the International Law Commission to both of which bodies he eventually went and played his part with great distinction and won the appreciation and esteem of all. He also functioned then as Chairman of the Atomic Commission into whose functioning he brought order and set it on correct lines. B.N. Rau, while he was representing India at the United Nations, was elected as a member of the International Law Commission and was Vice President of the Commission for sometime. He was there between 1948 and 1951. The Commission was composed of persons of acknowledged international legal competency and who jointly represented the first forms of civilization and the principal systems of law. The tribute paid to him by a Brazilian colleague on the International Law Commission is worth recalling : “…… Sir Benegal Rau started to speak; and with a clear voice and melodious accent he read what he had written from the notes he had taken. His language was almost precious due to its perfection. The way of talking was elegant and somewhat remote- as if the speaker were not there…. But he was there…. And the solution he proposed was practical and under the circumstances the only one capable of satisfying everybody. Agreement was immediately reached. The Commission was able to start in the following session on its work, knowing what it was doing.“A man of angelic appearance, extremely sweet in manners, a full idealist, but capable of dealing with reality and coldness from the right angle and not in a dreamy way, Sir Benegal is a man possessing the gift to surprise us when we least expect it. ….it is, indeed, a privilege to be able to put before the eyes of my countrymen such a beautiful expression of humanity, representing the highest and noblest human expression, indeed extremely human, the mirror of a culture many thousands of years old which employs the language of the West, in a better way than Occidentals do, because they do not possess the strength of the eternal, of the everlasting. And it pleases me, in addition, to acquaint the Brazilian people with the fact that I work abroad in their name alongside Sir Benegal.”Appropriately, Sir B.N. Rau crowned his career with a term as a judge of the International Court of Justice at Hague. He was elected to the World Court in 1951-52 by the United Nations General Assembly. On that occasion Justice Frankfurter wrote to him: “You are one of the people I have ever encountered who had a deep instinctive sense of justice. I begrudged the years you gave, I am sure conscientiously, to diplomacy and rejoiced when you took your rightful place on the Court.” As a man Sir Bengal was simple, humble and somewhat aloof. He was versatile as a lawyer, judge, law reformer, diplomat and constitutional architect. His career and contribution resonate the virtues of learning. He reminds us of not just the grace which learning brings to power but also the ways in which it enhances the benign face of power. ‘The idea of a jurist as a social architect, speaking to the future, comes alive in Rau’s luminous career’.This was the man who played a substantial and significant part in the making of our Constitution and who represented India for a time in the United Nations and the International Court of Justice. He took ill in the summer of 1953 and went somewhat before his time on 30th November, 1953 at the relatively young age of 66. There was an obituary reference to his passing away in Parliament, the Lok Sabha stood in silence for a minute as a mark of respect and paid him a standing tribute on 30-11-1953.Prime Minister Jawaharlal Nehru making the reference spoke of Sir Benegal bearing the great weight of his scholarship always in an unassuming, unobtrusive way, “I doubt if anyone saw him ruffled at all. Always he had the gentle way of approaching questions which surprised very greatly many people during the discussions in the United Nations because very hard words are used in the discussions there. But whatever was said B.N.Rau remained his quiet, gentle self without being ruffled or moved in the slightest. He had a distinguished career....he might well be called one of the principal architects of our Constitution.”Speaker Mavlankar said: “Although, as stated by the Hon. the Leader of the House, it is not the practice in this House to make reference to the passing away of non-Members, either of this Parliament or its predecessors, when the Hon. the Leader of the House asked me as to whether I could permit him to make a reference, I instinctively felt that I must, because the case here is quite exceptional. Apart from the unique personality of Mr. B.N. Rau and his eminent services to the country, what weighed most with me was that he was, as it were, interwoven in our present parliamentary life......... Apart from that, of course, he was an eminent Indian and it is but proper that we all should gratefully remember him and express our sorrow at his sad demise at a comparatively (as the Leader of the House said), young age.”Rich tributes were paid to him across the spectrum.President Rajendra Prasad wrote: When the history of the Indian Constitution comes to be written Sri B.N. Rau will occupy in it a significant place. Among the many stalwarts who played their part in the Constituent Assembly in the fulfilment of an extremely difficult undertaking, he distinguished himself by his erudition and detachment and his quietly persistent efforts.Writing in a review of the posthumous publication of Sir Benegal’s papers India’s Constitution in the Making by his brother Shri B. Shiva Rau, Shri M.C. Setalvad said: Those who came in contact with B.N. Rau learnt not only to admire his vast knowledge and deep study, but also to respect his relentless devotion to duty and his great humility of mind. A perusal of the papers now published has induced in the writer who had the privilege of having come in contact with him a greater esteem for his vast learning and simple personality reminiscent of the rishis of the old.B.N. Rau was not only very great, but very amiable and pure; his life and character not distinguished by a few admirable prominences, but uniformly elevated. His virtues were equal to his genius. All his achievements were solid, in whatever capacity he worked he left an indelible mark. George S. Hellman in his biography of Benjamin Cardozo recalled a passage from T.E. Shah’s translation of Homer’s Odyssey to describe Cardozo: “God will so crown what he says with a bloom of beauty that all who look on him are moved. When he holds forth in public it is with assurance, yet with so honey-sweet a modesty that makes him shine out above the ruck of men who gaze at him whenever he walks their city as if he were a god.” This more than aptly applies to Sir Benegal!It may be said of him as was said of Socrates, ‘A strange figure he was who stood out like a mountain peak dazzling in the last rays of the setting sun’. We will not see the likes of him again. When they make great men, they break the mould.Author is Senior Advocate at the Supreme Court of India. "
  },
  {
    "headline": "International Perspectives: Jurisdictional Considerations In Penalty Guidelines – US, EU, & UK",
    "data": "On 26th October 2023 the MCA released a notification[1] asking the CCI to issue penalty guidelines u/s 64 of the Competition Act, 2002, which gives it the authority to publish non-binding guidelines on the provisions of the Act. The Supreme Court in the Excel Crop Care Case[2] settled the law by incorporating the ‘Doctrine of Proportionality’ i.e. the penalties under the Competition Act could not be disproportionate and should not lead to shocking results.The Supreme Court in the Excel Crop Care case attempted to set out various illustrative factors that the CCI should consider when applying penalties.[3] These included: (a) the nature, gravity and extent of the contravention; (b) the role played by the infringer; (c) the duration and intensity of participation; (d) the bona fides of the infringer; (e) the profit / benefit derived from the contravention; (f) loss or damage suffered as a result of the contravention; (g) the market circumstances in which the contravention took place including: (i) the nature of the product; (ii) market share of the entity; and (iii) barriers to entry in the market. This was the starting point to the research regarding penalty guidelines in jurisdictions namely EU, US and UK.European UnionThe European Union relies on the EC Guidelines for the authority to impose a penalty of up to 10% of the total turnover or worldwide turnover of an undertaking. To determine the order of penalty, the European Commission (“EC”) relies on the European Commission Guidelines, which proposes a two- step procedure to ascertain the penalty.In the first step, the basic penalty amount is determined, taking into account the value of the undertaking's sales related to the infringement. The percentage of relevant sales, which can go up to 30%, is used to calculate this basic penalty, with the percentage varying based on the severity of the infringement. Various factors like the nature of the infringement, market share, geographic scope, and implementation are considered.In the second step, the basic penalty is adjusted. It can be increased for aggravating circumstances, like repeated infringements, and reduced for mitigating circumstances, such as evidence of termination or negligence in committing the infringement.Article 23 of the EC Guidelines[4] outlines the imposition of fines by the European Commission on undertakings and associations of undertakings for various violations. These fines are non-criminal in nature, and can be imposed when incorrect or misleading information, incomplete books or records are provided, during inspections; seals affixed by officials are broken etc. These are violations of Articles 81 or 82 of the Treaty, contravention of interim measures, or failure to comply with binding commitments. The fines can reach up to 1% of total turnover for specific violations and up to 10% of total turnover for infringements of Articles 81 or 82.The severity and duration of the infringement are considered when determining the fine amount. If an association of undertakings is not solvent, its members may be required to contribute to cover the fine, and payment may be directly demanded from individual members involved in decision-making bodies. However, members not implementing the infringing decision and distancing themselves from it may be exempted from such payments, with the financial liability not exceeding 10% of their total turnover.United KindgomThe Section 36(8) of the UK Competition Act, 1998[5] states that the penalties for contraventions may not exceed 10% of an undertaking's turnover. The Competition Market Authority’s Guidance as to the appropriate amount of penalty[6] (“CMA”) highlights a six-step procedure to arrive at the penalties which is as follows:The United StatesThe U.S. Department of Justice (“DOJ”) has taken several measures to expand its criminal antitrust enforcement efforts. These efforts include prosecuting labour-related antitrust violations, pursuing criminal enforcement of monopolization offenses, and utilizing algorithmic tools to detect collusion while adjusting its approach to information exchanges.In the area of labour markets, the DOJ is determined to criminally prosecute alleged no-poach and wage-fixing agreements, despite facing challenges in court. The DOJ's theory is that such agreements should be considered per se violations of the Sherman Act, subject to criminal prosecution, even though juries have often returned not guilty verdicts in related cases.[7]The DOJ has also announced its intent to pursue criminal prosecutions of alleged violations of Section 2 of the Sherman Act, which covers monopolization and attempted monopolization. This marks a significant departure from previous practices, where criminal charges were primarily limited to Section 1 violations, such as price-fixing and bid rigging. The DOJ's recent Section 2 cases involve unique facts and demonstrate a willingness to bring criminal charges for monopolization-related offenses.Part R of the United States Sentencing Commission Guidance Manual, 2021[8] prescribe guidelines for penalty against anti-trust offences specifically focusing on bid-rigging, price-fixing, or market-allocation agreements among competitors. The penalties are as follows:The volume of commerce for an individual participant is determined by the commerce done by them or their principal in goods or services affected by the violation. Special instructions for fines are also provided, including a range of fines for individuals based on a percentage of the volume of commerce, not less than $20,000.For organizations, the guideline fine range is determined under Chapter Eight (Sentencing of Organizations). The minimum multiplier for organizations is at least 0.75, ensuring that fines will be significant, serving as an effective deterrent to antitrust offenses.This guideline aims to tie the offense level to the scale or scope of the offense to ensure punitive sanctions and provide incentives for compliance. The volume of commerce is used as a measurable substitute for damages. The Commission believes that most antitrust defendants have the resources to pay the fines, either upfront or through instalments, over time.Views are personal.[1]http://d4.manupatra.in/ShowPDF.asp?flname=Competition_Form_of_Publication_of_Guidelines_RuleMANU_DCAF_0077_2023COM753175.pdf[2] Excel Crop Care Limited. v. Competition Commission of India and Another (Excel Crop Care)[3] https://www.mondaq.com/india/antitrust-eu-competition-/1347152/cci-penalties-on-global-turnover--relevant-and-proportionate[4] https://eur-lex.europa.eu/legal-content/en/TXT/?uri=CELEX%3A32003R0001[5] https://www.legislation.gov.uk/ukpga/1998/41/contents[6] https://assets.publishing.service.gov.uk/media/622f73c58fa8f56c170b7274/CMA73final_.pdf[7] https://globalcompetitionreview.com/review/the-antitrust-review-of-the-americas/2024/article/us-doj-tests-new-approaches-boost-cartel-enforcement-revival-efforts[8] https://www.ussc.gov/sites/default/files/pdf/guidelines-manual/2021/GLMFull.pdf "
  },
  {
    "headline": "The Need For A Comprehensive Blood Law For India: Thalassemia In Focus",
    "data": "In India, issues related to access and safety of blood have emerged time and again. This issue is particularly concerning in the case of repeat blood recipients like patients of blood transfusion dependent thalassemia major patients, who need frequent blood transfusions for survival[1]. The issue can be largely attributed to weak regulation governing blood transfusion services in India...."
  },
  {
    "headline": "Technology And Human Rights",
    "data": "Justice Chandrakant V Bhadang, President, ITAT; Justice R.V Easwar, former judge Delhi High Court; Shri S K Tulsiyan, President, Kolkatta IT Bar Association; Smt. Smita Srivastava, Pr. CCIT, W.B. & Sikkim; Shri Raj Pal Yadav, Vice President, ITAT, Kolkata Zone; Dr. N K Chakraborty, Vice Chancellor, N.U.J.S., Kolkata; Shri J.P. Khaitan, Senior Advocate, Calcutta High Court, my..."
  },
  {
    "headline": "Kapil Sibal Writes : We Are Witnessing Undeclared Emergency & Courts Are Silent",
    "data": "Indira Gandhi declared a National Emergency on June 25, 1975, under Article 356 of the Constitution on grounds of a breakdown of the constitutional machinery. Between June 25, 1975 and March 21, 1977, with the suspension of fundamental rights, several citizens of the country could not protect their liberties under Article 21 and 226 of the Constitution. The individuals targeted during..."
  },
  {
    "headline": "The Rise Of Deepfake Technology: A Threat To Evidence In Arbitration?",
    "data": "In the recent week, a video had been circulating of Rashmika Mandanna which was later proven to be deepfaked. The video caused immense humiliation to the actress who later on went to Instagram expressing her displeasure. Famous Actor Amitabh Bachan also went to social media to express his views to the same. Deepfakes are something that has come to public attention in recent times and is..."
  },
  {
    "headline": "COVID19: Plea Moved In Delhi HC Seeking Release Of Prison Inmates [Read Petition]",
    "data": "In light of the coronavirus outbreak, a plea has been moved in the Delhi High Court seeking temporary release of inmates from Tihar, Mandawali and Rohini prisons. Filed by Advocate Shobha Gupta, the petition highlights that the COVID19 virus has already reached three major prisons of Delhi. It is highlighted: 'on 18.3.2020, the Tihar Jail has quarantined about 18 inmates,..."
  },
  {
    "headline": "Tracing The Evolution Of Stare Decisis In English Courts From The Mid 19th Century Onwards",
    "data": "House Of Lords Position prior to 1966: Rigid, inflexible adherence to precedents Since years, the House of Lords had followed a very rigid adherence to the rule of precedents by holding that its previous decisions are as binding upon itself as they are on inferior courts. For the sake of certainty and consistency, the House debarred itself from ever reconsidering any of its..."
  },
  {
    "headline": "Allahabad HC Transfers Judge After He Allegedly Ordered A Police Man To Take Off Uniform",
    "data": "After a judge in Agra allegedly asked a police constable to remove his uniform in court as punishment for not giving passage to his car, the Allahabad High Court ordered his transfer, reports the Hindustan Times.On Saturday, the Registrar General of the High Court ordered the transfer of Judge Santhosh Kumar Yadav, from the post of Additional Chief Judicial Magistrate of Agra to that..."
  },
  {
    "headline": "UK Supreme Court's Verdict On Rwanda Asylum Policy & Reflections On Indian Supreme Court's Approach To Rohingyas",
    "data": "In a significant legal development, the United Kingdom Supreme Court recently issued a ruling, declaring the UK government's policy of relocating asylum seekers to Rwanda unlawful. Led by the UK Home Secretary, this policy drew intense scrutiny for its potential breach of the principle of non-refoulement, a bedrock of international refugee and human rights law, as per which, a country..."
  },
  {
    "headline": "International Cooperation And Legal Mechanisms To Combat Wildlife Black Market Activities",
    "data": "Wildlife crime like illegal drugs and weaponry, are trafficked by deadly transnational networks. It is nearly impossible to collect credible numbers for the value of the illegal wildlife trade due to its very nature. The wildlife trade monitoring network estimates that the traffic is worth billions of dollars. As a result of their increasing focus to unlawful global..."
  },
  {
    "headline": "The Quest For Intellectual Property Protection: A Global View On Video Game Characters’ Copyright",
    "data": "The digital age has witnessed an unprecedented surge in the popularity of video games, turning them into a mainstream form of entertainment. Central to the success of many video games are the characters that inhabit these virtual worlds. The protection of these characters under copyright law is a critical aspect of safeguarding the creative efforts invested in their design and..."
  },
  {
    "headline": "Filing Of Caveat Under Section 148a Of Civil Procedure Code, 1908",
    "data": "There are prevailing misconceptions among young lawyers and even among the many experienced practitioners pertaining to Caveat. The existing misconception regarding Caveat is the thinking that the Caveat is like a magic wand which when waved will bring the decision of the Court in their favour. This article discusses important judgments, filing of a caveat under Section 148 A of CPC,..."
  },
  {
    "headline": "POCSO In Hindsight; Expanding The Scope Of Protecting Children From Sexual Abuse And Exploitation",
    "data": "The recent uproar against ‘age of consent’ as per the POCSO- Protection of Children from Sexual Offences Act 2012 (amended 2019) demands critical thinking. As custodians of our children and culture, we need to examine the idea of childhood, sexuality and sexual crimes through a scientifically informed, queerfeminist lens and explore otherwise uncharted gray areas of..."
  },
  {
    "headline": "\"Parliamentary Privileges In Case Of Defamation Justified Or Not?\"",
    "data": " Lawmakers in India enjoy special rights thanks to Articles 105[1] and 194[2] of the Constitution. The said privileges are governed under Rule No. 222 of the Lok Sabha Rule Book and Rule 187 in chapter 16 of the Rajya Sabha rulebook. Members of parliament have an absolute privilege, which means they cannot be sued in any court for defamatory words or sentences spoken during..."
  },
  {
    "headline": "All “Disclosure Statements” By An Accused Are Not “Confessions”",
    "data": "A “disclosure statement” made by an accused person leading to the recovery of an object under Section 27 of the Indian Evidence, 1872, can attract the taboo under Sections 25 and 26 of the Evidence Act, only if such a statement includes or amounts to a “confession”.“Confession” is an “admission” which in turn, is a “statement” 2. A closer examination of the scheme..."
  },
  {
    "headline": "Democratizing International Tax Law",
    "data": "The Indian Supreme Court, on October 19, reaffirmed an important constitutional principle that international obligations assumed by the executive cannot have the force of law unless definite statutory conditions are met. The judgment, delivered in Assessing Officer (International Tax)vs. Nestle SA, considered whether a government notification is pre-requisite to enforcing..."
  },
  {
    "headline": "Jharkhand In Dire Need Of Hematologists – Actions In The Form Of Legal Injunctions Expected From Thalassmia  Patients",
    "data": "On October 12, 2023, the Jharkhand High Court after hearing a Public Interest Litigation (PIL) for the cause of thalassemia patients asked the state government to outline the facilities that are available in the state of Jharkhand regarding treatment and blood transfusion to patients suffering from thalassemia. Sickle cell anaemia and thalasmmeia has a reasonable prevalence rate of eight..."
  },
  {
    "headline": "Harassment Tort In Different Jurisdictions: A New Horizon",
    "data": "Tort is an infringement of legal obligation which amounts to civil wrong. The purpose of tort law is to provide a relief against a harm that has been done to a person and to protect them from the wrongdoings of others. Usually, this is done by compensating the victim with monetary compensation. In the economically developed nations like U.S.A, Australia, Canada and U.K., tort law..."
  },
  {
    "headline": "Can OpenAI Secure the 'GPT' Trademark? A Comparative Analysis Under US And Indian Trademark Laws",
    "data": "Recently OpenAI, a US based software company applied for the trademark of “GPT-5” with the United States Patent and Trademark Office (USPTO). GPT-5 is an advanced version of the ChatGPT AI, which is owned by OpenAI. If the company secured the trademark successfully, then it would ensure an exclusive right over the product. However, the way ahead is not as simple as it may appear...."
  },
  {
    "headline": "Bail Under Juvenile Justice Act",
    "data": "The Juvenile Justice Board (JJB) plays a crucial role in implementing the Juvenile Justice Act of 2015. Section 8 of the Act provides that for all proceedings under the Act, the board constituted shall have the jurisdiction. The Court of Sessions or the High Court may interfere only when an order has to be passed under section 19 or when an appeal or revision has to be..."
  },
  {
    "headline": "Justice Anand Venkatesh Writes : Dire Need Of “A Tall Figure“ to Guide The Judiciary",
    "data": "On a Sunday afternoon, after a siesta, feeling fresh and rejuvenated, a thought started occupying my mind. This article is the result of a consequential impulse to put these thoughts to paper. The thought that caught my attention was - the exponential improvement in the standards of legal education in India after the advent of National Law Schools, thanks to Dr. N.R. Madhava Menon, the..."
  },
  {
    "headline": "Column 12 Of Charge-Sheet, Delhi Police Showing A Person As ‘Suspect’ Is Arbitrary, Illegal, Unconstitutional",
    "data": "In Delhi, there is pernicious practice of Delhi Police of mentioning a person, against whom no incriminating evidence was found in the investigation, as a ‘Suspect’ in final Police Report. The practice is arbitrary, illegal, unconstitutional and ultra vires to the Code of Criminal Procedure, for the reason that it is settled law that the trial is always of an accused and once..."
  },
  {
    "headline": "Unravelling Vienna Convention Amid India-Canada Rift On Diplomatic Parity",
    "data": "Amidst the recent arousal of geopolitical tensions between India and Canada, India asked its Canadian counterpart to decrease the size of its diplomatic mission to ensure the numerical parity of staff working in both countries. Following India’s requisition, Canada has removed its 41 diplomatic agents and their families, considering safety concerns post a threat of withdrawing..."
  },
  {
    "headline": "Urgent Interim Relief Under Section 12 A (1) Of Commercial Courts Act, 2015,- A Camouflage Or Reality",
    "data": "Clearing the mist of controversy among the courts of our nation, the Hon’ble Supreme Court of India in a landmark Judgement of M/s Patil Automation Private Limited Vs. Rakheja Engineers Private Limited laid down that pre institution mediation in commercial matters is mandatory for the parties before approaching the commercial courts. However, in Patil Automation, the Hon’ble Apex..."
  },
  {
    "headline": "Global Biofuel Alliance: India’s Tryst With Sustainable Development Goals",
    "data": "Biofuel technology encompasses a diverse array of methods for generating fuels from organic sources such as crops and biomass. The process begins with the selection of appropriate raw materials, ranging from corn to vegetable oils. There are two primary conversion techniques: biochemical, which involves fermentation, and thermochemical, utilising processes like pyrolysis. Biodiesel..."
  },
  {
    "headline": "Legal Odyssey On Non-Heterosexual Marital Rights In Indian Tapestry - A Comment On Supriyo Vs. Union Of India",
    "data": "Despite decriminalization, the queer community faces ongoing violence, oppression, and ridicule. The State's limited efforts to address discrimination post-Section 377 persist. The law, especially Section 377, imposed social norms on homosexual relationships, shaping societal beliefs about queer identity. This lasting impact contributes to continued discrimination, pushing many..."
  },
  {
    "headline": "Divide If Disclosed: Divisional Patent Applications Interpreted By Syngenta Limited V. Controller Of Patents And Designs",
    "data": "Divisional patent applications are distinct filings stemming from an initial parent patent application. The divisional process is typically employed when the original application asserts multiple, yet separate inventions concurrently. There may be instances where the initial application's scope is overly broad, or the claims within it are too varied to be adequately scrutinized in..."
  },
  {
    "headline": "Breaking Barriers : How Justice Ravindra Bhat Expanded Scope Of Disability Rights",
    "data": "Justice S Ravindra Bhat, who retired as a Supreme Court judge on October 20, has made immense contributions to the expansion of disability rights jurisprudence in our country. He has advanced a pragmatic and purposive interpretation of the statutory provisions to further inclusivity and accessibility for persons with disabilities in the public sphere.Even before his elevation to the..."
  },
  {
    "headline": "Reimagining Insolvency Resolution: Reverse CIRP A Game-Changer For India’s Real Estate Sector",
    "data": "The real estate industry is one of the thriving sectors in the modern business world. There are three parties in the real estate business – the real estate companies and their promoters (who develop the properties), the homebuyers (who purchase the flats/ apartments by engaging with the real estate developers), and the financial institutions (banks and other forms of..."
  },
  {
    "headline": "Justice Ravindra Bhat's Scholarly Legacy : A Look At His Important Judgments",
    "data": "“Fraternity is not the assimilation of the minority into the majority. To the contrary, it is the celebration of peaceful coexistence of differences that constitutes our national identity.\" - Justice Ravindra Bhat at a public lecture.In the world of jurisprudence, there exist those who simply interpret the law, and then there are those exceptional few who redefine it. Justice Ravindra Bhat,..."
  },
  {
    "headline": "Sex Workers, Their Adult Dependants, And Conflicting Laws",
    "data": "The Supreme Court of India in Budhadev Karmaskar vs State of West Bengal[1] held that prostitutes also have a right to live with dignity under Article 21 of the Constitution of India since they are also human beings and their problems also need to be addressed. Thereafter in 2022, in Budhadev Karmaskar v. State of West Bengal and Others[2] held that the “basic protection of human decency..."
  },
  {
    "headline": "Equality Marriage Verdict: A Damper on the Century old Social Movement",
    "data": "The Indian Supreme Court passionately decriminalized the sex by same-sex partners in the Navtej Singh Johar Case and it upheld the constitutional rights of Non-heterosexuals or Queer or lesbians, gay bisexuals and transgender (LGBT) to cohabit as part of their privacy rights guaranteed by the Constitution of India. However, the apex court quietly backed out in the Marriage Equality Case..."
  },
  {
    "headline": "How Laws Are Made In India",
    "data": "Recently Parliament has introduced the 3 Bills in Criminal Major Acts ; Bharatiya Nyay Sanhita Bills to( replace CRPC), Bhartiya Nagrik Suraksha Sanhita Bills to ( replace IPC) and Bhartiya Sakshya Bill to (replace Evidence Act) in August 2023. Women Reservation Bills 2023 (106 Constitutional Amendment Bill)have also received presidential assent. It is thus important to..."
  },
  {
    "headline": "Why The BCI Should Reconsider The Rules Governing The Provision Of A Scribe And ‘Extra Time’ For Pwd Applicants In AIBE-XVIII ?",
    "data": "Earlier today, the Bar Council of India (BCI)released a revised schedule for the All India Bar Examination (AIBE)-XVIII, postponing the exam to 26th November 2023. To practice law in courts and tribunals of India, one has to clear the AIBE, conducted biannually, within 2 years of their provisional enrolment with a State Bar Council. With every subsequent edition of the exam, the BCI..."
  },
  {
    "headline": "War For Talent – Antitrust & Collusion In The Labour Market",
    "data": "No-poach agreements (NPAs) are an emerging trend in global antitrust policy. It’s an agreement between employers to restrict hiring each other’s employees. In 2015 in the US, top tech companies Apple, Google, Intel Corp, and Adobe Systems Inc settled for $415 million payout to resolve an antitrust class action accusing them of conspiring to avoid cold calling each other’s..."
  },
  {
    "headline": "Safe Harbor: Bridge To Innovation Amidst The Waters Of Liability?",
    "data": "Today internet has become an integral part of our daily lives, and the concept of safe harbour provisions has emerged as a critical legal framework. These provisions aim to strike a delicate balance between fostering innovation and holding online platforms accountable for the content they host. Different jurisdictions around the world have adopted varying approaches to safe..."
  },
  {
    "headline": "Speedy Justice And Lengthy Delays, The Arbitration Process",
    "data": "Through the decades, it has been witnessed that Arbitration carries a huge possibility for delays either due to the court’s procedural interference or due to non-compliance with the limitation periods specified under the Act. However, the real paradox arises in the post-arbitral award stage. This is because often when a party is dissatisfied with the final award and approaches the court..."
  },
  {
    "headline": "Article 20 (3) & Test Identification Parade: The Question Of Rights And Obligations",
    "data": "The Supreme Court of India recently in a judgment[1] passed by it has delved into whether Test Identification Parade is violation of fundamental rights bestowed upon an accused under Article 20 (3) of the Constitution. Article 20 (3) of the Constitution provides that “No person accused of any offence shall be compelled to be a witness against himself”. The right guaranteed under..."
  },
  {
    "headline": "Doctrine Of Frustration",
    "data": "Frustration is a helplessness arising from impossibility. The doctrine of frustration therefore discharges parties from their obligation to perform a contract when a contract is hit by an event that makes its performance impossible. Even though, the semantic meaning appears simple, it has become a complex subject because of a thin line of distinction between several concepts such as..."
  },
  {
    "headline": "Remission Granted Or Not Granted: Crossing The ‘Laxman Rekha’",
    "data": "‘Clemency’ refers to the act of showing mercy or leniency to individuals who have been convicted of crimes. This can be in the form of a pardon, reprieve, commutation, or remission of their sentences. ‘Remission’ generally refers to the reduction or mitigation of a sentence that has been imposed on a person who has been convicted of a crime and allows for the reduction of the..."
  },
  {
    "headline": "Differentiating Jurisprudence On Pre-Condition To Invoke Arbitration",
    "data": "In India, it is a common trend to incorporate a pre-condition under the arbitration agreement to follow certain conditions to invoke the dispute resolution clause. The rationale behind having these provisions in the arbitration agreement is to prevent frivolous claims and invocation of arbitration or any other dispute resolution claim. On the other hand, these provisions also..."
  },
  {
    "headline": "Decrypting Arnesh Kumar Guidelines For Making Arrest",
    "data": "It is almost a decade since the Supreme Court passed a slew of guidelines in Arnesh Kumar v. State of Bihar, 2014 for curbing unnecessary arrests at the hands of police officers. However, till today, I find confusion persisting in the minds of lawyers, police officers, and litigants as to the exact import of these guidelines. In this article, I will throw some light to decrypt and..."
  },
  {
    "headline": "BNSS – A Case Of Missed Opportunity",
    "data": "The recently tabled Bharatiya Nagarik Suraksha Sanhita, 2023 (BNSS), which aims to replace Code Criminal Procedure, 1973 (Cr.P.C.) misses out a great opportunity to reform our criminal procedure system. This article discusses two significant issues from a common man’s perspective: (a) registration of FIR/Complaint leading to initiation of the investigation; and..."
  },
  {
    "headline": "Electronic Evidence In The Bharatiya Sakshya Bill, 2023 – Regressive Or Progressive?",
    "data": "As the world started communicating electronically by way of emails and text messages, mutual obligations crystalized without putting pen to paper, admissibility of electronic evidence was introduced by way of Section 65A and 65 B in the Indian Evidence Act, 1872 (IEA) in the year 2000. Section 65 B of IEA: The interpretation of Section 65 B of IEA has resulted in..."
  },
  {
    "headline": "Rajesh and Another v. The State of MP : A Patently Erroneous Interpretation Of Section 27 Of Evidence Act By Supreme Court",
    "data": "C O N T E N T SSl. No:I N N E R T I T L E SPARANO.ATHE IMPELLING PROVOCATION FOR THIS ARTICLE. 1BWRONG VERDICTS AT THE TOP MAY BREED MYRIADS OF ILLEGALITIES AT THE BOTTOM.2CPERNICIOUS TREND OF CONFLICTING VERDICTS FROM THE APEX COURT, DESPITE ALL TECHNOLOGICAL FACILITIES. The functional privileges at the disposal of the Judges. The reference order of Justice M. P. Menon..."
  },
  {
    "headline": "Leniency Plus: Excessive Generosity Or A Shiny Armor In The Indian Leniency Regime?",
    "data": "In a bid to aid the Competition Commission of India’s (“CCI”) cartel enforcement efforts, the Competition (Amendment) Act 2023 (“Amendment”) has introduced the ‘leniency plus’ tool in India.[1] Leniency means discounts on fines for disclosing an anticompetitive cartel. Leniency plus means firms coming forward to reveal one cartel can get additional discounts if they..."
  },
  {
    "headline": "Are Deep Fakes Digital Chameleons?",
    "data": "In an era dominated by artificial intelligence (AI), a new breed of mischief has emerged - deepfakes. These cunning concoctions, born from the marriage of “deep learning” and “fake,” are causing quite a stir. They have become a riddle wrapped in a puzzle, challenging our perception of reality and posing a profound question: How do we grapple with this digital deception..."
  },
  {
    "headline": "CCI Can Scrutinise PSUs: A Stepping Stone Towards Competitive Neutrality",
    "data": "Recent decision in the case Coal India Limited(“CIL”) v. Competition Commission of India (“CCI”) by the Supreme Court of India (“SC”) has revived the discussion around the principle of Competitive Neutrality in the Indian market. A full bench of SC settled the ongoing tussle between CCI and CIL over the reconciliation of Coal Mines(Nationalisation) Act, 1973..."
  },
  {
    "headline": "Is Section 17 Of The Senior Citizens Act Void?",
    "data": "Legal aid is everyone’s right for securing justice. On the authority of Article 39-A of the Constitution of India, the State shall secure that the operation of the legal system promotes justice based on equal opportunity and shall in particular provide free legal aid by suitable legislation or schemes or in any other way to ensure that opportunities for securing justice are not denied..."
  },
  {
    "headline": "Search And Seizure – The Best Practices",
    "data": "Search and seizure are an important tool in the hands of law enforcement agencies (LEA) to properly investigate a case. The power to search and seize can be exercised by the police either suo moto under section 165 of Code of Criminal Procedure, 1973 (hereinafter referred as CrPC) or under a warrant issued by the court under section 93 CrPC. While the law authorizes the police to..."
  },
  {
    "headline": "The Election Commission Bill, 2023: The Way Far Away From Independence",
    "data": "The Chief Election Commissioner and Other Election Commissioners (Appointment, Conditions of Service and Term of Office) Bill, 2023 (the Bill) was introduced unexpectedly in Rajya Sabha in the last days of the monsoon session of the Parliament. From the Statement of Objects and Reasons of the Bill, it can be understood that the Bill aimed to replace the selection committee..."
  },
  {
    "headline": "Sequestering Digital Autonomy: How New Data Protection Act Affects Digital Accessibility",
    "data": "The much-awaited Digital Personal Data Protection Act, 2023 (DPDP Act, 2023) is reflective of the indispensable mechanism required to ensure the digital autonomy of the users at a time when India becomes the second country with the highest number of internet users (692 million). However, whether digital autonomy is available to everyone equally is the question to..."
  },
  {
    "headline": "Impleadment Of Unnecessary Parties In Consumer Disputes: Akin To The Principles Of CPC?",
    "data": "Consumer disputes are an inherent part of the modern marketplace, and as e-commerce has grown in popularity, they have become even more common. The Consumer Protection Act, 2019 a social welfare legislation in India, deals with protecting consumer rights. The objective of the Act is to protect the interests of the consumers and for timely settlement of disputes so as to safeguard the..."
  },
  {
    "headline": "Pornography v. Mother’s Cooking: A Rather Forced Match",
    "data": "Kerala High Court, in a judgment delivered on Teachers’ Day, on 5th September, while deciding the legal question of whether a person watching a pornographic video in his private time constitutes an offence, launched into a lecture on good parenting in the following words:“9. But before parting with this case, I must remind the parents of minor children in our country. Watching pornography..."
  },
  {
    "headline": "India's Conflict Resolution Landscape: Exploring Mediation Vis-à-Vis Restorative Justice",
    "data": "In the steadily evolving landscape of dispute resolution, India has witnessed a noticeable surge in Alternative Dispute Resolution (ADR) mechanisms, including mediation, arbitration and Lok Adalats. ADR techniques operate outside the litigation process and can be employed to resolve various types of disputes, contingent upon the mutual consent of the parties. Recent statistics,..."
  },
  {
    "headline": "Arbitration Award And Stamp Duty Paid On It",
    "data": "Award of an Arbitrator is an instrument chargeable with duty as per section 3 of the Indian Stamp Act, 1899. There is no exemption for any Award. Is any duty payable on an Award dismissing a claim? If any duty is payable on such an Award, what is the rate at which it is payable? If no duty is payable, even when the property involved in the dispute is valued at hundreds of crores of..."
  },
  {
    "headline": "Un-naming India: Unsettling the Firmly Established Identity",
    "data": "Sudden Emergence of a Needless Controversy Lately an unwarranted contestation concerning the name ‘India’ has been whipped up out of nothing. A deliberate effort appears to be underway to create a political binary between India and Bharat. Expectedly, the social atmospherics are now abuzz with conflicting, polarizing views characterized by acute ignorance and distortions. As a..."
  },
  {
    "headline": "Women's Reservation & Our Founding Mothers: Reflections On Constituent Assembly Debates",
    "data": "The Centre’s introduction of the Constitution (One Hundred and Twenty Eighth Amendment) Bill, 2023, otherwise known as the Women’s Reservation Bill, has created a buzz in all sectors by proposing to reserve one-third seats for women in the Lok Sabha, the State Legislatures, and the Delhi Legislative Assembly. This Bill, which is expected to raise the political representation of women,..."
  },
  {
    "headline": "Evaluating Chhattisgarh’s Policy On Candidates With Pending Charges: Addressing  Violence Against Women Or Raising Questions Of Justice?",
    "data": "On the 11th of September, 2023, the Government of Chhattisgarh issued an Order vide. 1-1/2017/1-3[1] under the Chhattisgarh Civil Services (General Conditions of Service) Rule, 1961. This order bars such candidates for appointment in Government services who are facing the charges of certain provisions of the Indian Penal Code, 1860, pertaining to offences against women, or if they..."
  },
  {
    "headline": "Madras High Court Stays IT Dept's Order Imposing ₹1.5 Crore Penalty On Actor Vijay For Undisclosed Income",
    "data": "The Madras High Court on Tuesday granted an interim stay on the proceedings initiated by the Income Tax Department against Actor Vijay for \"admitted\" undisclosed income of Rs. 15 crore in the financial year 2015-16. The bench of Justice Anita Sumanth passed the interim order on an application filed by the actor and directed the Department to file its counter by September 16.The penalty..."
  },
  {
    "headline": "New Inter Services Law For The Military In India: Action In Haste",
    "data": "The successful passage of Inter-Services Organizations (Command, Control and Discipline) Bill, 2023 by the Parliament is projected a major statutory step to make the theatre commands effective[1]. The law would apply to the above category of military formations. Tri service establishments have been part of the military for long. National Defence Academy, Defence Services Staff..."
  },
  {
    "headline": "On The Verdict In “Srinivasulu”— A Recently Reported Corruption Case",
    "data": " It was only now that I chanced to browse through the Judgment dated 15-06-2023 rendered by the Supreme Court of India in A. Srinivasulu v. The State represented by the Inspector of Police, CBI (Criminal Appeal No: 2417/ 2010) and authored by Justice V. Ramasubramanian. It is a well written judgment. The primary facts leading to the prosecution of the accused in the case have..."
  },
  {
    "headline": "Landmark Decisions, Invaluable Contributions – Revisiting Ram Jethmalani’s Legal Journey",
    "data": "As we commemorate another year of Ram Jethmalani’s birth anniversary, we are reminded of the sheer presence and stature he brought to each case he argued – irrespective of the client he represented, the area of law the case concerned itself with, or any other extraneous factor. For him, his duty to the court was always paramount, and his allegiance to his client’s cause was undeterred...."
  },
  {
    "headline": "Interim Awards In Arbitration: Complexities And Distinctions",
    "data": "In the realm of arbitration proceedings, interim awards play a critical role in navigating the course of dispute resolution. In appropriate cases, interim awards help in substantially reducing the scope of adjudication of the dispute, thereby contributing towards effective and expeditious resolution, which is fundamental to arbitration. Under the provisions of the Arbitration..."
  },
  {
    "headline": "Evaluating The Mediation Bill, 2023",
    "data": "Among the Bills passed in the recent session of the Parliament is the Mediation Bill, 2023. This Bill has the potential to reframe how we understand access to justice in India. After more than twenty years of policies enabling and mandating mediation and conciliation, these expressions are no longer unfamiliar to us. These are processes where persons in conflict take the assistance..."
  },
  {
    "headline": "Recourse To Article 226/227 In Consumer Disputes: Can The Power Of The High Courts Be Ousted?",
    "data": "The Consumer Protection Act, 1986 [‘the 1986 Act’] is a holistic and beneficial piece of legislation which is consumer oriented in its approach and seeks to provide expeditious reliefs to aggrieved consumers. The 1986 Act was repealed by the Consumer Protection Act, 2019 [‘the 2019 Act’]. Both these Acts provide for remedies in cases of disputes qua deficiency of goods/services..."
  },
  {
    "headline": "Justice And Fairness In Arbitration - An Overlooked Principle?",
    "data": "Arbitration is emerging as a powerful dispute resolution mechanism to address the challenges posed by hefty litigation costs and time-consuming legal proceedings in courts of law, thereby offering mutually agreeable and amicable means of resolving disputes. The idea of party autonomy is one of the essential components of the arbitration mechanism as a result of the pressing..."
  },
  {
    "headline": "The Question Of ‘Completion Of Pleadings’ Under Section 29A Of The Indian Arbitration And Conciliation Act,1996.",
    "data": "The Arbitration and Conciliation Act, 1996 amended in 2015 first introduced section 29A which prescribed the time limit of 12 months for an Arbitral Tribunal to conclude the proceedings and pass an award from the date it enters reference. The objective of the amendment was to expediate the arbitration proceedings and to make them more time efficient and desirable to the..."
  },
  {
    "headline": "One Country, Many Names: What The Architects Of Our Nation Said About ‘India, That Is, Bharat’ In Constituent Assembly",
    "data": "Hundreds of years ago, famous English playwright William Shakespeare wrote, “What’s in a name? That which we call a rose, by any other name would smell as sweet.” This is what Juliet says to herself, as she ponders over the meaning of a name. Hundreds of years later, we ponder over the same thing, against the backdrop of rumours of a name change to be proposed for the country in..."
  },
  {
    "headline": "Relevancy Of Constituent Assembly Debates For Interpretation Of The Constitution",
    "data": "Constituent Assembly debates are frequently cited before courts to canvas a particular interpretation of the Constitution. The Supreme Court has referred to the Constituent Assembly debates in important constitutional cases such as A K Gopalan vs. State of Madras, Golak Nath vs. State of Punjab and Kesavananda Bharati vs. State of Kerala. This article advocates a nuanced approach to..."
  },
  {
    "headline": "Anti-Corruption Law Should Receive A Purposive Interpretation At The Hands Of The Constitutional Courts",
    "data": " C O N T E N T S Sl. Order. I N N E R T I T L E S Para No. A THE PROVOCATION 1 B REFERENCE TO THREE JUDGES’ 2 C REFERENCE TO CONSTITUTION BENCH (CB) 3 D THE APPROACH BY THE CB 4 ..."
  },
  {
    "headline": "Sale Of Mentally Ill Person’s Property",
    "data": "A person competent to transfer immovable property means an adult (who has attained the age of majority) having sound mind. An adult in comatose state or having mental illness or Autism, Cerebral Palsy or any other disability, is not capable of taking legal decision and hence cannot enter into contracts including sale deed for sale of immovable property held by him. In India, we..."
  },
  {
    "headline": "Discussing The Discrepancies And Errors In The Bharatiya Sakshya Bill, 2023",
    "data": "Union Home Minister on August 11, 2023 introduced three bills namely Bharatiya Sakshya Bill, Bharatiya Nyaya Sanhita Bill and Bharatiya Nagarik Suraksha Sanhita Bill, with the aim to overhaul the criminal laws of the country and abolish Indian Evidence Act, 1872, Indian Penal Code 1860 and Code of Criminal Procedure 1973. The bills are referred to parliamentary standing committee..."
  },
  {
    "headline": "Preventing Multiplicity And Streamlining Processes For Disability Certification",
    "data": "A Division Bench of the Delhi High Court, in a recent order, upheld a circular of the Indian Railways for issuing separate identity cards for persons with disabilities (“PwDs”) for the purpose of availing concessions such as discounted tickets and reserved seats (previously reported by Live Law here). While the issuance of such separate identity cards may be instrumental in..."
  },
  {
    "headline": "Money Laundering :  A Process Or A Punishment",
    "data": "Money laundering is something as engaging “proceeds of crime” in any matter projecting as untainted money. It's pandemonium; concealing a transaction a sham transaction to put together a legitimate coffer. The act catches money laundering. Thus, money laundering is “parasitic” and hence cannot arise if there is no scheduled offense and/or if there are no proceeds of crime. He..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Reshaping The Canvas: The Thaler Echo",
    "data": "In a recent legal development, the United States District Court for the District of Columbia adjudicated upon a pressing question at the crossroads of Artificial Intelligence (“AI”) innovation and Copyright Law. The case, Stephen Thaler v. Shira Perlmutter, Register of Copyrights and Director of the United States Copyright Office, et al.[1] (“Thaler”), has gained..."
  },
  {
    "headline": "Bhartiya Nagrik Suraksha Sanhita: Worse Than The British",
    "data": "While tabling The Bhartiya Nagrik Suraksha Sanhita, 2023 as a replacement for the Code of Criminal Procedure, 1973, the Home Minister announced that the new law governing procedure in the criminal justice system would get rid of a backward colonial legacy and bring an Indianised law more appropriate for modern India. Even a casual comparison of the old and the new however would show..."
  },
  {
    "headline": "With Several Delhi Riots Cases Collapsing In Courts, Delhi Police Must Face Questions On Accountability",
    "data": "\"When history will look back at the worst communal riots since partition in Delhi, it is the failure of investigating agency to conduct proper investigation by using latest scientific methods, will surely torment the sentinels of democracy,\" a Delhi Court observed in September 2021.Three years on, courts in the national capital have continuously passed strictures against the Delhi..."
  },
  {
    "headline": "LGBTQIA+ Rights In India: Struggles, Progress, And The Road Ahead",
    "data": "Article 15 of the Indian Constitution stands as a beacon of hope, vowing equality and protection against discrimination on diverse grounds, including sex. Unfortunately, the LGBTQIA community in India has grappled with substantial hurdles in rephrasing this indigenous pledge into reality. This article embarks on a journey through time, exhuming the literal acknowledgment of..."
  },
  {
    "headline": "A Bright Student Of HNLU Raipur Is No More",
    "data": "Trigger Warning – Mentions of suicide, self-harm, depression.A final year female student of HNLU, Raipur, who hails from Bihar, was found in an unconscious state in the hostel washroom by her friends on 24th August 2023 noon. She was taken to the nearby hospital immediately but was declared brought dead. The University authorities have suspended all classes till 3rd of September and..."
  },
  {
    "headline": "13 Years On, Central Information Commission Is Held Together Only By An ‘Interim’ Order",
    "data": "The Central Information Commission (CIC) is the apex body at the central level to ensure proper implementation of the Right to Information Act, 2005. The Delhi High Court had ruled in 2010 that its method of functioning is illegal and needs to be changed. This was stayed by the Supreme Court, and CIC’s current functioning is hanging just by this ‘interim’, unreasoned order, even..."
  },
  {
    "headline": "Grant Of Custody Of Accused To Investigating Agency Under Section 167 Of CrPC",
    "data": "The criminal procedure code is principally procedural in nature laying down the procedure to be followed in criminal trials, however some of its provision contains trapping of substantive rights as well. In this context, the classic example of Section 167 Criminal Procedure Code (henceforth “CrPC”) needs special mention, which is uniquely positioned to contain hybrid structure..."
  },
  {
    "headline": "New Criminal Reforms: Substantial Change Or Linguistic Imperialism?",
    "data": "On 11 August 2023, the Central government introduced three new Bills in the Lok Sabha to replace the Indian Penal Code, 1860 (“IPC”) as Bharatiya Nyaya Sanhita, 2023 (“BNS”), the Code of Criminal Procedure, 1973 (“CrPC”) as Bharatiya Nagarik Suraksha Sanhita, 2023 (“BNSS”), and the Indian Evidence Act (“IE”) as Bharatiya Sakshya Bill, 2023 (“BSB”). This article..."
  },
  {
    "headline": "Whether “Recovery Evidence” By Itself Is Substantive Evidence",
    "data": "The answer to this question can be in the “negative” in the majority of cases and “positive” in certain limited category of cases. The celebrated Pulukuri Kottaya v. Emporer AIR 1947 PC 67 (Lord Wright, Lord Simonds, Lord Uthwatt and Sir John Beaumont), itself contains the answer to this question. Supposing the accused is having in his possession or is concealing in his room..."
  },
  {
    "headline": "The New Bills On Criminal Law Bring More Dissapointment Than Hope",
    "data": "When the constituent assembly finished drafting our Constitution, a new dawn awaited the people of India. It was a moment of proud metamorphosis that needed a realization that the words “We the people” have started to resonate with the citizens who no longer were the subjects of their colonial masters. The words in the opening quote were meant to warrant caution and were orated by..."
  },
  {
    "headline": "Delhi High Court Issues Notice On Appeal Preferred By Sushant Singh Rajput’s Father Against Refusal To Stay Movie Based On Late Actor's Life",
    "data": "The Delhi High Court on Thursday issued notice on an appeal moved by the father of late Bollywood actor Sushant Singh Rajput against the single judge order refusing to injunct further telecast of the movie “Nyay: The Justice” based on his son’s life, which was released on OTT platform Lapalap in June 2021.A division bench of Justice Yashwant Varma and Justice Dharmesh Sharma sought..."
  },
  {
    "headline": "Splinternet: New Domain Of ‘Network Sovereignty’",
    "data": "The rising cases of internet shutdowns and the spread of online misinformation have divided online users into numerous often hostile factions. “An intentionally divided internet is a threat to business, innovation, and democracy” emphasized an article recently on MIT Management Sloan School highlighting the ways in which ‘splinternet’ is damaging society. As the battles in..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Why GNCTD (Amendment) Act 2023 May Not Pass Constitutional Test Despite Changes From Services Ordinance?",
    "data": "On August 12, the Government of National Capital Territory of Delhi (Amendment) Act 2023, which seeks to diminish the powers of the elected government of Delhi over services, received the assent of the President and came into effect from May 19, 2023.It may be recalled that May 19 is the date on which the President promulgated the GNCTD(Amendment) Ordinance 2023 containing similar provisions,..."
  },
  {
    "headline": "Electronic Evidence Under The Bhartiya Sakshya Bill, 2023: A Pandora’s Box To Be Reopened!!",
    "data": "With the introduction of new bill, the Bhartiya Sakshya Bill, 2023, the law of evidence in India is all set to change. With the new bill outgoes the law that ruled world of evidence for almost 150 years. Looking back at the jurisprudence, one can surely say that the evidence act in its present form did amazing job in dealing with the traditional cases pertaining to oral and..."
  },
  {
    "headline": "Ligature/Strangulation Mark On The Neck – Is It Really Suicide/Murder?",
    "data": "It is often observed that on finding a ligature mark on the neck of a person, the investigating agency would be quick to carry out investigation prima facie treating the case to be of either homicide or suicide, unmindful of the fact that it could very well also be a case of natural death whereafter a scene of crime might have been meticulously created to simulate suicidal hanging..."
  },
  {
    "headline": "Beneath The Ground, Where The Air Of Freedom Is Still Lacking: The Evil Practice Of Manual Scavenging",
    "data": "On 15 August 1947 India became independent from the British Rule and at the stroke of mid-night, India rose to freedom, but unfortunately even after 76 years there are some citizens who can’t even feel the air of freedom because in those septic tanks, even their dignity isn’t counted. Even today caste remains a major source of occupational and class division in our country, at a time when..."
  },
  {
    "headline": "District Public Prosecutor And The Verdict Of The Kerala High Court In Omanakuttan Nair’s Case",
    "data": " Sl. No: I N N E R ..."
  },
  {
    "headline": "Contribution Of Dr. Justice S. Muralidhar To Orissa Judiciary",
    "data": "“A great leader’s courage to fulfil his vision comes from passion not position.” The wordings of John Maxwell vastly demonstrates the very essence of Justice Muralidhar’s tenure as a Chief Justice in the High Court of Orissa. His passion for law and justice transcended beyond the fragile limitations of pride and prejudice prevalent in the legal fraternity. The bounds of..."
  },
  {
    "headline": "The Ambiguity Of Copyrightability Of AI-Generated Works",
    "data": "An increasing number of people are becoming aware of the usability of tools such as Chat GPT, DALL-E, and Midjourney. Undoubtedly, the influence of such tools is seen to be prominent in the creative realms, making it easier to turn your concepts into different forms of art by inputting the right prompts, but like any new trend which lacks formal legal endorsement, the sudden increase..."
  },
  {
    "headline": "Corporate Distress And Compassion: Integrating Humanitarian Values Into NCLT's Decisions",
    "data": "The Insolvency and Bankruptcy Code, 2016 (IBC) is a landmark legislation that aims to provide a speedy and efficient resolution of Insolvency and Bankruptcy cases in India. The IBC empowers the National Company Law Tribunal (NCLT) to admit and adjudicate applications for initiating Corporate Insolvency Resolution Process (CIRP) against defaulting companies. The IBC's primary goal is..."
  },
  {
    "headline": "'Denying Information Under The Guise Of Data Protection' : Concerns Raised About Digital Personal Data Protection Bill Amending RTI Act",
    "data": "The Parliament passed the Digital Personal Data Protection Bill on Wednesday. The Bill seeks to provide protection to “personal data” and has provision to process it for “lawful purposes.”However, a significant change that the Bill has introduced is an exemption to provide personal information under Right To Information Act (RTI).Section 44 (3) of the Bill amends Section 8 (1)(j) of..."
  },
  {
    "headline": "Junior Law Associate Vacancy At Shandilya Law Offices [Apply Now]",
    "data": "Shandilya Law Offices invites applications for the post of Junior Law Associate at their I.P. Extension (Patparganj), Delhi office. Name of the Post: Junior Law AssociateSalary: As per industry standardsEssential Qualification and Experience• A Degree in Law with at least 2-4 years of experience in Litigation.• The candidates should possess strong writing/ analytical skills and should be able to communicate effectively with clients and colleagues.Area of Practice – Litigation, Civil and Criminal, Finance, Dispute Resolution and Matrimonial Disputes, etc.Roles & Responsibilities• The candidates will be drafting and preparing documents, formulating strategies and conducting legal research.How to apply?• Interested candidates are required to submit their CVs along with a cover letter to email id shandilyalawoffices@gmail.com"
  },
  {
    "headline": "Kerala Govt Decision To Appoint Justice Manikumar As SHRC Chairperson Raises Questions",
    "data": "The Kerala Government’s decision to appoint Justice S Manikumar as the Chairperson of the State Human Rights Commission within a few months of his retirement as the Chief Justice of the Kerala High Court raises questions.Post-retirement appointments, which take place soon after retirement, cast a cloud on the perception of judicial independence. Justice Manikumar had a fairly long stint as..."
  },
  {
    "headline": "Extent Of NCLT’s Jurisdiction Over Contractual Disputes During CIRP",
    "data": "A moratorium (stay) is imposed on all the legal proceedings (pending or future) by virtue of Section 14 of Insolvency and Bankruptcy Code 2016 ( IBC), when Corporate Insolvency Resolution Process ( CIRP) is initiated against a Corporate Debtor ( CD). In case a third party initiates any action against the CD (in terms of any penalty) the Resolution Professional ( RP) on behalf of the CD..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "A Tribute To Justice Muralidhar By Justice R V Easwar",
    "data": "As I sat listening to the farewell speech of Justice Muralidhar on his retirement as Chief Justice of the Odisha High Court, two things struck me. First, can this man be provoked to anger at all? Second, why does he have to be so self-effacing? During my return flight to Chennai, I kept thinking of these traits in him. To the first question, the definite answer is a big NO. And the reason..."
  },
  {
    "headline": "By Not Standing Up For Justice S Muralidhar, Supreme Court Collegium Fails Yet Another Independent Judge",
    "data": "In the last week of February 2020, when parts of North Eastern regions of Delhi were gripped with communal riots, several injured victims were trapped in a relatively small hospital in Mustafabad. They needed emergency critical care and had to be immediately taken to a bigger hospital with facilities. However, due to the raging riots, ambulances were not in a position to reach there...."
  },
  {
    "headline": "Multistate Cooperative Societies Amendment Bill 2022 – A Bird’s Eye View",
    "data": "“Founded on the principles of private initiate, entrepreneurship and self-employment underpinned by the values of democracy, equality and solidarity the co-operative movement can help pave the way to a more just and inclusive economic order.” Kofi Annan With the formation of the Union Ministry of Cooperation in July 2021 a separate administrative, legal..."
  },
  {
    "headline": "AI, Actors, And Intellectual Property: Hollywood’s Struggle For Balance",
    "data": "The Writers Guild of America (WGA) and the Screen Actors Guild–American Federation of Television and Radio Artists (SAG-AFTRA) have gone on a strike. The WGA began on 02 May, 2023 followed by the SAG-AFTRA on 13 July, 2023. It is claimed that there shall be no writing, filming, casting or promotion of movies or television shows till their demands are met. Collectively, this..."
  },
  {
    "headline": "Dawn Of Mediation – A Relief For Justice?",
    "data": "The wait seems to be finally over! The entire mediation fraternity, like anxious fathers waiting outside the labour room, were waiting for the birth of Mediation Act. This seems to be the only discussion or question that was being asked by judges, mediators, arbitrators and lawyers in all the recent conferences and seminars on ADR – “When will the Mediation Act come?” But even now..."
  },
  {
    "headline": "MahaRERA:De-Registration Of Real Estate Projects",
    "data": "The Real Estate (Regulation and Development) Act, 2016 (for short, “RERA”) which came into force on 1st May, 2017 has been enacted in the larger public interest for the purpose of settlement of disputes and smooth redressal of grievances between the home buyers and the builders/developers accompanied with increasing transparency in the real estate sector. Under section 34 of the..."
  },
  {
    "headline": "Challenges Of Statute Mandated Arbitration Under The National Highways Act, 1956",
    "data": "Background“Interminable, time-consuming, complex, and expensive court procedures impelled jurists to search for an alternative forum, less formal, more effective, and speedy for resolution of disputes, avoiding procedural claptrap and this led them to Arbitration Act, 1940. However, the way in which the proceedings under the Act are conducted and without exception challenged in courts has..."
  },
  {
    "headline": "Supreme Court's 'Illegal But Permissible' Jurisprudence",
    "data": "There is an obvious difference between a judgment of the Court and a newspaper editorial or an opinion piece. While both seek to take a principled stand and appeal to a higher ethical conscience, a court judgment has the power to create real world consequences, whereas an editorial piece can only aim to shape public opinion at an abstract level. The Court’s judgment can nullify the effects..."
  },
  {
    "headline": "Green Hydrogen: Empowering India’s Journey Towards Energy Independence And Net Zero Emissions",
    "data": "“Sustainable and inclusive development has become a prevailing global agenda over the past few decades, garnering significant attention and dedication from nations across the world.” World Bank, 2018 (Transforming our World: The 2030 Agenda for Sustainable Development) Sustainable and inclusive development has been the global goal for the past..."
  },
  {
    "headline": "Decoding The Mental Healthcare Act, 2017: An In-depth Analysis Of India's Mental Health Legislation",
    "data": "In the coeval times, the term “health” is not limited to the physical aspect of the body but also includes mental and spiritual well-being. The concept in itself has attracted colossal credibility and has encouraged the government to look after the existing facilities and make way for up-to-the-minute developments taking place in terms of mental health care. The Mental Health Care..."
  },
  {
    "headline": "Dushyant Dave Writes: On Manipur, Supreme Court Must Be More Proactive",
    "data": "The videos on social media and reports of the women being publicly assaulted by a group of people in Manipur are among the worst manifestations of communal frenzy. The Supreme Court of India has, belatedly, taken suo motu cognisance of the situation and observed: “We are expressing our deep concern. It is time that the government really steps in and takes action. This is simply..."
  },
  {
    "headline": "Principle Of Fresh Start And Children In Conflict With Law",
    "data": "The Juvenile Justice (Care and Protection of Children) Act 2015 (hereupon referred to as the JJ Act) is a law that holds immense significance for the welfare of children in India. The development of juvenile justice jurisprudence in our country is ongoing, with new challenges arising daily. These challenges provide an opportunity for courts to establish a positive legal precedent on..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "SEBI Intends To Do Away With The \"Promoter\" Label?",
    "data": "The recent issue of equity transfer to family trust structures in the case of a popular fintech company has once again shed light on a certain lacuna in the regulator's system, one that SEBI (Securities Exchange Board of India) is yet to fix. To understand the issue in detail, we must first take a look at the definition of “Promoter”. A promoter of a company is generally defined as..."
  },
  {
    "headline": "The Unheard Will Of The People- A Question Of Public Consultation",
    "data": "The recent invitation for public suggestions by the 22nd Law Commission (LC) on the feasibility of the Uniform Civil Code (UCC) has raised important questions about the approach taken by the commission regarding public consultation. In a diverse country like India, it becomes crucial to examine how the public is involved in such exercises. The focus of this article is not to discuss..."
  },
  {
    "headline": "A Look At The Forest Conservation (Amendment) Bill, 2023",
    "data": "The Forest Conservation (Amendment) Bill, 2023 will be presented during the Monsoon session of the Parliament which is likely to begin today. State governments including Chhattisgarh and Jharkhand, environmental and civil society organizations, activists and students have submitted their objections to the bill introduced by Shri Bhupender Yadav, the Minister of Environment, Forest and..."
  },
  {
    "headline": "Deploying Drones For Prison Surveillance: A Security Or Privacy Threat?",
    "data": "The legislature and judiciary has mostly overlooked the concerns of prisoners regarding the situations of life in prison throughout our history. There are several international agreements that set standards for how prisoners should be treated including Universal Declaration of Human Rights, (1948), Convention against Torture and other Cruel Inhuman or Degrading Treatment..."
  },
  {
    "headline": "Not Uniform Civil Code: India's Plural Legal System May Enlighten The World",
    "data": "The abolishing of Personal Laws of India (PLI) is challenging questions in post-colonial India even after 75 years, when India is officially celebrating the glorious history of its people, culture, diversity, the elixir of freedom and achievements. The ‘new India’ is stuck with incredibly old debates, which reflect the immense internal diversity of this massive nation state..."
  },
  {
    "headline": "Regulatory Framework To Deal With Carbon Emissions From Aircrafts",
    "data": "When persons across the globe are gasping for clean air to stuff their lungs in order to get the spell of life, it becomes important to deal with the issue of carbon emission from aircrafts with utmost precision. The amplitude of choice made by flyers in terms of opting air travel as most convenient mode of transport, may kindle distress among environmental campaigners. The augmented..."
  },
  {
    "headline": "Father Stan Swamy Died As A UAPA Martyr; But Political Prisoners Continue To Suffer Without Bail",
    "data": "Two years ago, on July 5, Father Stan Swamy died as an undertrial prisoner in the Bhima Koregaon case after 270 days of incarceration. The 84-year-old Jesuit priest and tribal rights activist – arrested over alleged links to Naxals – was the country’s oldest inmate charged under the anti-terror law, the Unlawful Activities (Prevention) Act. “But we still sing in chorus. A caged..."
  },
  {
    "headline": "Understanding The UP-Gangster Act: A Comprehensive Analysis",
    "data": "Recently in June 2023, Mukhtar Ansari, Ex-UP MLA, was awarded a life sentence in the 32-year-old Awadesh Narain murder case. A fine of Rs. 1 lakh has also been imposed upon him. The MP/MLA court in Varanasi announced the quantum of punishment. Last year, a special MP/MLA Court of Ghazipur convicted him under The Uttar Pradesh Gangsters and Anti-Social Activities (Prevention)..."
  },
  {
    "headline": "Using Fairness Opinions By IFAs To Improve India’s RPT Framework",
    "data": "Related Party Transactions [‘RPT’] refers to dealings between parties with an existing relationship or a common motive. Due to concerns with conflicts of interest and abuse of power in such transactions, the Securities and Exchange Board of India [‘SEBI’] has put in place measures in the Companies Act as well as the SEBI Listing Obligations and Disclosure Requirement..."
  },
  {
    "headline": "NCP Rift : Examining Validity Of Ajit Pawar Group's Actions In The Light Of Supreme Court's Judgment In Shiv Sena Case",
    "data": "Monsoon seems to be season for high political drama in Maharashtra. The script of the drama appears same, only the actors change. If it was the rift within the Shiv Sena party which set off dramatic events last Monsoon, this year it is the rift within the Nationalist Congress Party (NCP). A section led by Ajit Pawar and Praful Patel have broken ranks with the NCP supremo Sharad Pawar and..."
  },
  {
    "headline": "Justice Mukta Gupta – From A Prosecutor’s Desk",
    "data": "Justice Mukta Gupta’s retirement draws curtain on a remarkable tenure as a Judge of the Delhi High Court. During her retirement function, she repeatedly mentioned that it was her fourth innings in the legal profession. Indeed, prior to being appointed as a Judge, Justice Gupta appeared on behalf of the State/Govt. of NCT of Delhi as an Additional Public Prosecutor,..."
  },
  {
    "headline": "TN Governor Is Liable To Be Recalled Due To His Unconstitutional Actions",
    "data": "There are enough and more reasons for the President of India who appointed RN Ravi as the Governor of Tamil Nadu to recall him as he has repeatedly defied his constitutional oath of office and acted as a law unto himself. He had been doing so in the past but he has now crossed all limits after he unilaterally dismissed Senthil Balaji from the Council of Ministers without the advice of the..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Is It Time for India to Reconsider Its Stand on The Hague Abduction Convention?",
    "data": "After decades of skeptical side glances and nervous flirting, India and the United States finally seem ready to take their relationship to the next level. Prime Minister Modi’s recent state visit to the United States is a testament to the beginning of a new era of stronger ties between the two countries. In every relationship, certain topics are off-limits for discussion. However,..."
  },
  {
    "headline": "Examining The Ambiguities Surrounding Finality Of Interim Awards",
    "data": "On June 14, 2023, the Ministry of Law and Justice constituted an expert committee for evaluating the working of the Arbitration law in India, examine its strengths and weaknesses, and recommend the reforms in the Arbitration and Conciliation Act, 1996 (“the Act”). This has given us an opportunity to look into the loopholes of the Indian arbitral ecosystem and work upon them. One..."
  },
  {
    "headline": "A Review Of The NGT On Environmental Compensation And Waste Management Implementation",
    "data": "The National Green Tribunal (NGT) since its inception has been vigorously adjudicating environmental disputes in accordance with the legislative and governmental policies. Headlines in the media of heavy penalty or compensation by the court are being reported often. Despite such headlines, the same media on the other page report the poor quality of the air, polluted rivers,..."
  },
  {
    "headline": "Compensatory Afforestation: Highlights And Challenges",
    "data": "Under the Forest (Conservation) Act, 1980, whenever forest land is diverted for non-forest purposes such as residential, commercial, mining and industrial purposes, an equivalent area of non-forest land has to be taken up for compensatory afforestation. Additionally, in line with the ‘polluter pays’ principle, the entity responsible for such land diversion is also liable..."
  },
  {
    "headline": "Are Dissenting Financial Creditors Adequately Protected Under Section 30(2)(e) Of The Insolvency And Bankruptcy Code (IBC)?",
    "data": "When a Resolution Applicant (RA) submits a Resolution Plan to the Committee of Creditors [“CoC”], the CoC engages in extensive discussions to decide whether to approve or reject the plan. If the plan is rejected and brought before the National Company Law Tribunal (NCLT), the NCLT initiates the liquidation process as per Section 33(1) of the Insolvency and Bankruptcy..."
  },
  {
    "headline": "World Drug Day: 20 Important Judgments On The Narcotic Drugs and Psychotropic Substances Act",
    "data": "“The Narcotic Drugs and Psychotropic Substances Act has been enacted with the object of meeting the unprecedented challenge of illicit traffic in narcotic drugs and psychotropic substances. Drug abuse has been recognized as the single most powerful social offender in recent times creating unimaginable extent of damages on frighteningly large sections of the society. Its effect on the..."
  },
  {
    "headline": "Rights Of Autistic People And Duties To Autistic Children",
    "data": "Rights of Autistic people:A. EducationLegal FrameworkThe Right to Education Act 2009 safeguards education rights for all children in India, including those with special needs like autism.The act ensures free and compulsory education for children aged 6 to 14 and promotes inclusive education.Children with disabilities, including autism, can receive education in mainstream schools under the..."
  },
  {
    "headline": "Power Sector Peril: Unmasking The Threats Of Cyber Security",
    "data": "Technology has brought several changes in the human life. Better healthcare, education, commerce, travelling, lifestyle, every aspect of human life is influenced by technology. But like every coin has two sides, technology has pros as well as cons. Cybersecurity is one of the issues related with technology. In the recent times, with advent of modern modes of crimes, cyberwars have..."
  },
  {
    "headline": "Understanding Recent Amendments To RPwD Rules, 2017",
    "data": "On 5th June, the Ministry of Social Justice and Empowerment (“MoSJ&E”) notified the amendment to the Right of Persons with Disabilities Rules 2017 (“RPwD Rules”) in the official gazette. This amendment substituted the 2016 Harmonised Guidelines and Space Standards for Barrier-Free Built Environment for Persons with Disability and Elderly Persons (“Harmonised Guidelines..."
  },
  {
    "headline": "An Analysis Of The Digital Personal Data Protection Bill, 2022",
    "data": "The Digital Personal Data Protection Bill, 2022 introduces a new framework for personal data protection, making it paramount to comprehend and understand its applicability and functions. The Government of India sees this released bill as one of the parts of its larger vision of a Digital Economy, this vision will include a comprehensive “Digital India Act” that would in due course..."
  },
  {
    "headline": "Jhuggi Demolitions : How Actions Of Authorities Go Against The Legislative Intent",
    "data": "For the last several weeks Delhi has been witnessing a large-scale eviction of the jhuggi dwellers ahead of an international event in the capital. The eviction drive has rendered hundreds of children, women and old people homeless and thrown into the streets during this scorching summer. Arbitrary jhuggi demolitions are not new in the country, especially in the capital. But the ongoing drive..."
  },
  {
    "headline": "The Saga Of Money Bill Controversies In India",
    "data": "Chief Justice DY Chandrachud recently made an oral remark on the constitution of a 7 judge bench for considering the money bill issue. Its formation is due to the reference made by the constitution bench in Roger Mathew v. South Indian Bank[1] on the interpretation of Article 110(1) of the Constitution of India. The correctness of the majority judgment in Aadhaar case[2] on this point..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Intestate’s Husband And Intestate’s Wife",
    "data": "Since the Hindu Succession Act, 1956 or the Indian Succession Act, 1925 do not contain the definition of the terms ‘widow’ and ‘widower’, the dictionary meaning of the said terms to be taken into consideration. According to Merriam Webster dictionary the meaning of ‘widow’ is a woman who has lost her spouse or partner by death and usually has not remarried and the meaning..."
  },
  {
    "headline": "Soliciting And Advertising By Lawyers",
    "data": "In January 2023, the Supreme Court Advocates-on-Record of India (SCAORA) took notice of an issue involving Forbes India Magazine's publication of a \"Legal Powerlist\" featuring the top 25 Advocates on Record in India. Following a complaint, the SCAORA unanimously passed a resolution condemning the list and calling for its removal, as lawyers are prohibited from soliciting or advertising..."
  },
  {
    "headline": "Incorporating Environment, Social And Governance Norms Into Indian Corporations",
    "data": "Environment, Social and Governance (ESG) norms are a set of standards that provide a framework for the company’s operations to have more accountability and transparency and ensures that the operations follow better governance, environmentally friendly measure and social responsibility. Concerning the Environment, it mainly deals with potential climate risks, carbon footprints,..."
  },
  {
    "headline": "Justice KM Joseph : Indian Democracy & Secularism Will Always Be Indebted To Him",
    "data": "As an intellectual judge with deep knowledge in various fields of law, Justice KM Joseph has authored several notable judgments. Yet, the fight led by him against hate speech would be regarded as one of his most momentous interventions. On several occasions, he showed the prescience to diagnose hate speech as a cancer, which will create a hell out of our great nation if allowed to..."
  },
  {
    "headline": "The Restricted Scope Of A Lawyer’s Role",
    "data": "A lawyer or an advocate is defined as a person who is licensed to practice law. While performing this licensed practice, legal practitioners play a vital role of advising and consulting their clients, preparing their cases, and are also responsible for presenting oral and written arguments, in addition to this, all the clerical work involved in the court process is also majorly done..."
  },
  {
    "headline": "COWIN- Alleged Breach & Concerns About Enforcement Of Data Privacy",
    "data": "Some newspapers have reported that there has been a compromise of the Co-Win database. In line with its past behavior, the Government was quick to deny that the database was breached. While the government’s statement may sound like an outright denial, but it is limited to the breach of the Co-Win portal and does not deny a compromise of data through other means. The PIB release itself..."
  },
  {
    "headline": "Status Of Law Clerks?",
    "data": "The Supreme Court of India and High Courts hires young law graduates on an adhoc basis for Law Clerk-Cum-Research Associates. The Law Clerks are assigned with the work of assisting the Judges in both judicial and administrative work. The scheme of engagement of Law Clerk was revised recently by the Supreme Court in 2023. Even though the nature of work, duties and responsibilities are..."
  },
  {
    "headline": "Breaking Down The Fallacies In UAPA",
    "data": "In recent years, The Unlawful Activities (Prevention) Act (UAPA)[1], has been the subject of intense scrutiny and debate. While it was enacted with the intention of combating terrorism and ensuring national security, its implementation and the consequences have sparked concerns about the erosion of civil liberties and the stifling of dissent. With the increasing concerns over the UAPA,..."
  },
  {
    "headline": "Unilateral Appointment of Arbitrator: In defense of Legislative Intention",
    "data": "The Government’s undying effort to make India a truly globalized economy and an attractive spot for investment has laid the foundation for a robust international arbitration framework. One of the vital stimulant to attract investment and promote cross border trade is a stable, cost and time effective mechanism to resolve disputes. The biggest inducement for non-Indian entities to choose..."
  },
  {
    "headline": "Selling Cigarettes In India Without Statutory Warnings",
    "data": " India has 267 million tobacco smokers, making it the country with the world's second highest number of tobacco users. Tobacco is currently smoked by around 100 million persons aged 15 and older and it is believed to be responsible for more than 1.2 million fatalities.[1] The most common method of communicating the health consequences of smoking is through health warnings on..."
  },
  {
    "headline": "Micro, Small And Medium Enterprises- The Heart Of Indian Economy",
    "data": "Out of the current estimated GDP of India, which stands at 273.08 Lakh Crore Rupees, roughly 30 to 32% is contributed by the Micro, Small and Medium Enterprises (MSME); the share of MSME in manufacturing sector of our country is about 37%, in exports it is about 50%, and cater to roughly about 11.10 Crore jobs in the country.[1] Clearly, they are one of the main pillars the..."
  },
  {
    "headline": "All High Courts Weekly Round-Up: May 23 - May 29, 2022",
    "data": "Allahabad High Court NOMINAL INDEX Ram Chandra v. State 2022 LiveLaw (AB) 255 Jyoti Sikka v. State Of U.P. Thru.Legal Remembrancer Dept. Of Law And Justice Lucknow 2022 LiveLaw (AB) 256 Nawab v. State of UP 2022 LiveLaw (AB) 257 Chhunna v. State of U.P 2022 LiveLaw (AB) 258 Siddharth Varadarajan And Another v. State Of U.P. And 2 Others 2022 LiveLaw (AB) 259 Mahendra..."
  },
  {
    "headline": "Law Commission’s Report on Sedition Ignores Free Speech Law and Indian Colonial History",
    "data": "The Law Commission of India released its 279th Report on ‘Usage of the Law of Sedition”. The Report not only recommends for the retention of the colonial era provision, but also seeks to enhance the prescribed punishment from three years to seven years. Further, in a feeble attempt to add clarity to the law, the Report defines the term “tendency” as a “mere inclination to..."
  },
  {
    "headline": "ITAT Allows Deduction On Penalty Levied By SEBI For Shortfall In Margin Money",
    "data": "The Mumbai Bench of the Income Tax Appellate Tribunal (ITAT)has allowed the deduction of the penalty levied by the Securities and Exchange Board of India (SEBI) for a shortfall in margin money.The bench of B.R. Baskaran (Accountant Member) has observed that the penalty levied by SEBI for shortfall in margin money cannot be considered as a penalty for violation of any law falling within..."
  },
  {
    "headline": "Policing of Prayers",
    "data": "The Indian state has been becoming a shrinking space for liberal and secular discourse. The actions of the various actors as well as the ruling party have been responsible for such a state of events. The growing religious intolerance has become cynical and taken a monstrous shape. The events which occurred in Uttar Pradesh are a testimony to this fact. On 23rd December, the principal of..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Vicarious Liability In Cheque Bounce Cases: Unable To Quash Trial Court Proceedings",
    "data": "Businesses and traders depend on cheques especially for those transactions above Rs 2 lakhs. Cheque is one of the most preferred instruments of exchange, business entities usually issue cheques to clear their debts as and when they expect to receive huge profits. Business is a money-making activity with calculated risks and at times one doesn’t receive amount which they..."
  },
  {
    "headline": "Avoidance Of Undervalued Transactions Under Section 45 Of The IBC, 2016",
    "data": "The transactions that can be avoided or those referred to as avoidable transactions are covered under Sections 43 to 51 of the Insolvency and Bankruptcy Code, 2016, respectively. There are three types of transactions that fall within this category, preferential (Section 43), undervalued (Section 45), and fraudulent (Section 66) transactions. In the landmark case of Anuj Jain Interim..."
  },
  {
    "headline": "World Environment Day: Important Judgments On Environmental Protection",
    "data": "“Natural resources are the assets of the entire nation. It is the obligation of all concerned, including the Union Government and State Governments to conserve and not waste these resources. Article 48-A of the Constitution requires that the State shall endeavour to protect and improve the environment and to safeguard the forest and wildlife of the country. Under Article 51-A, it is the duty..."
  },
  {
    "headline": "Market Value, Can The Collector Look Beyond The 3 Parameters Provided In Clauses (a), (b) And (c) Of Section 26(1) Of The 2013 Land Acquisition Act?",
    "data": "Section 26(1) of the Right to Fair Compensation and Transparency in Land Acquisition, Rehabilitation and Resettlement Act, 2013 is as below: ‘(1) The Collector shall adopt the following criteria in assessing and determining the market value of the land, namely:— (a) the market value, if any, specified in the Indian Stamp Act, 1899 (2 of 1899) for the registration of sale deeds..."
  },
  {
    "headline": "Allahabad HC Transfers Judge After He Allegedly Ordered A Police Man To Take Off Uniform",
    "data": "After a judge in Agra allegedly asked a police constable to remove his uniform in court as punishment for not giving passage to his car, the Allahabad High Court ordered his transfer, reports the Hindustan Times.On Saturday, the Registrar General of the High Court ordered the transfer of Judge Santhosh Kumar Yadav, from the post of Additional Chief Judicial Magistrate of Agra to that..."
  },
  {
    "headline": "Restrictive Clauses V. Law Of Limitation: Can The Right To Arbitration Be Restricted To A Lesser Period Than Provided Under The Limitation Act?",
    "data": "It is not uncommon for arbitration practitioners to come across agreements, the provisions of which are lop-sided and designed to favour the dominant party or the employer. These clauses are almost non-negotiated and one party is often made to sign on the dotted lines. These may inter alia include clauses like the requirement of mandatory pre-arbitration deposit,[1] unilateral option..."
  },
  {
    "headline": "Improving The Functioning Of The National Company Law Tribunal – A Perspective",
    "data": "The National Company Law Tribunal (NCLT), established on 01 June 2016 under the Companies Act, 2013, is a premier tribunal in the commercial and economic field. Its primary litigants are financial sector entities and bodies corporate. The enactment of the Insolvency & Bankruptcy Code, 2016 (IBC) is often cited as one of the main drivers for India’s quantum jump from rank 142 in..."
  },
  {
    "headline": "Adani-Hindenburg : Did The Supreme Court Panel Ask The Right Questions?",
    "data": "To get the right answers, one needs to ask the right questions.The expert committee constituted by the Supreme Court in the Adani-Hindenburg case has made a prima facie finding that there is no regulatory failure on the part of the Securities and Exchange Board of India (SEBI) in relation to the Adani group of companies. However, a reading of the 173-page report leaves an impression that..."
  },
  {
    "headline": "Delhi Govt vs LG : Why The GNCTD Ordinance Which Nullifies Supreme Court Judgment Is Unconstitutional?",
    "data": "A week after the Supreme Court delivered the judgment in Government of NCT of Delhi v. Union of India recognising the legislative and executive powers of the National Capital Territory of Delhi over “services”, the Union Government promulgated the Government of National Capital Territory of Delhi (Amendment) Ordinance, 2023 which nullifies the effect of the Constitution Bench verdict...."
  },
  {
    "headline": "Data Protection Standards For Cross Border Data Transfers In India: Suggestive Approaches And Way Forward",
    "data": "Global data flows have substantially risen in recent years, along with trade in digital services across borders. As per the Report published by the World Bank, in 2020, global internet traffic was estimated to be approximately three zettabytes which counts to one GB per day per person. This volume is expected to double fold itself in the coming years. Such a huge amount of data flow is..."
  },
  {
    "headline": "Kiren Rijiju : Law Minister Who Crossed The Line Too Far With Rhetoric Against Judiciary",
    "data": "Kiren Rijiju spent nearly two years as union law minister, of which almost six contentious months was spent at loggerheads with the judiciary over a number of issues – ranging from the selection of judges to the problem of pendency. In this time, he has been a tireless advocate for enlarging the role of the executive in judicial appointments, becoming somewhat of a messiah to..."
  },
  {
    "headline": "“Delhi High Courts Direction On Reviewing The Government Policy On The Patentability Of Business Method Patents.”",
    "data": "The issue of patentability of business method patents is complex and multifaceted, and it varies between jurisdictions. Recently, the office of the Controller of Patents and Designs refused the application for grant of a business method patent titled ‘System and method to provide gift media’ under Section 15 of the Patents Act, filed by US-based company OpenTV Inc. In response to its..."
  },
  {
    "headline": "Justice MR Shah : A PM Modi Admirer, Known For Pro-Executive Stance In Civil Liberty Issues",
    "data": "When Justice MR Shah was appointed as a Supreme Court judge in November 2018, there was a general speculation that he is likely to be a pro-executive judge, especially in view of the public comment made by him about Prime Minister Narendra Modi a few months before his elevation. In August 2018, as the Chief Justice of the Patna High Court, Justice Shah hailed Prime Minister Narendra Modi as..."
  },
  {
    "headline": "Rule Of Repugnancy And Appointment Of Arbitrator Under The Indian Arbitration Regime",
    "data": "Recently, the Delhi High Court, in Sunil Kumar Chandra v Spire Techpark Pvt. Ltd. (“Spire Techpark”), has held that in case where there is an inconsistency between two clauses in an agreement, the latter clause is to be rejected as being repugnant and that the earlier clause prevails. Against the decision of the Delhi High Court, a Special Leave Petition was preferred, and the..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "The Bias Of An Arbitrator: Is The Remedy Under Section 14 Foreclosed?",
    "data": "Independence and impartiality of the arbitrator are the most important requirement of arbitration proceedings.[1] Fairness in the adjudication and rule against bias form part of the basic notions of justice and morality. Natural justice demands the adjudication of a dispute in an impartial way and the same squarely applies to arbitration proceedings also. Therefore, the importance of..."
  },
  {
    "headline": "[Know The Law] Standards Applicable To News Media",
    "data": "Recently, Hon’ble Justice B.V. Nagarathna, speaking at an event on “A free and balanced press: sentinel of democracy”[1] stressed the importance of a free and balanced press. She discussed the growing menace of misinformation and yellow journalism as a threat to democracy. Further, she highlighted the need for “some regulation that binds new age journalism”. The contemporary..."
  },
  {
    "headline": "The Judgment Of Obergefell V. Hodges And The Philosophical Foundations Of Same-Sex Marriage",
    "data": "On 26th June, 2015 the American Supreme Court by a razor – thin majority of 5-4 decided the historic case of Obergefell Vs. Hodges, 576 US 644 (2015) and ruled that marriage is a Fundamental right of every individual and that this fundamental right to marry, in its comprehensive sense, is guaranteed to same-sex couples under both the ‘due process clause’ and the ‘equal..."
  },
  {
    "headline": "Justice Akil Kureshi Writes : Recent Judgment Of Supreme Court In 'Vikram Bhatia' Sets A Deeply Disturbing Trend",
    "data": "Article 265 of the Constitution of India provides that no tax shall be levied or collected except by authority of law. This short Article in a most emphatic manner prevents the State from collecting tax arbitrarily. At the same time, the Courts recognize a great degree of latitude in the legislation in the field of taxation. In a landmark judgment in the case of R.K. Garg, it was observed..."
  },
  {
    "headline": "17 Months Delay In Delivering Judgment : When Supreme Court Ignores Its Own Directions To Pronounce Verdicts Promptly",
    "data": "The Supreme Court on May 4 decided to set aside an order by a magistrate in Kolkata directing a police investigation into an allegation of gang rape and criminal intimidation against Bharatiya Janata Party leader Kailash Vijayvargiya and others. Interestingly, the top court, which has in the past issued guidelines to ensure prompt adjudication by high courts after the..."
  },
  {
    "headline": "Reclaiming The Freedom Of Speech And Expression In An Orwellian Dystopia",
    "data": "The median age of this graduating class, I'm guessing, is 23. That would make \"The Emergency\" little more than a historical concept, a period heard or read about, but of no greater immediacy than the British Raj, the freedom struggle, Independence, or Partition. Born a quarter century after what was seen as the great aberration of 1975-1977, and coming of age in an era of..."
  },
  {
    "headline": "Recent Acquittals From Supreme Court Reflect Deep Malaise In Our Criminal Trial System",
    "data": "\"Every acquittal should be understood as a failure of the justice delivery system, in serving the cause of justice. Likewise, every acquittal should ordinarily lead to the inference, that an innocent person was wrongfully prosecuted\" - Supreme Court in State of Gujarat vs Kishanbhai (2014)A series of orders passed by the higher courts recently, acquitting convicts in murder cases after..."
  },
  {
    "headline": "Whether Law Of Limitation Applies To The DV Act?",
    "data": "The Protection of Women from Domestic Violence Act, 2002 (for brevity “the Act”) was enacted in 2002 for the serpentine issue of domestic violence against women at large in almost all spheres of society in different manners. The Act has indeed become a water-shed moment for the rights of the aggrieved women, and has provided almost all the practical reliefs that an aggrieved woman may..."
  },
  {
    "headline": "A Relationship Still Undefined : Remembering Justice Thottathil B Radhakrishnan",
    "data": "“You don’t know how deeply you are intertwined with someone until they leave you” Writing an obituary about someone who was closely associated with your life is painful, especially when you are struggling to come to terms with their untimely passing. Therefore, it is difficult for me to put to words my thoughts about my beloved senior Shri. Thottathil B Radhakrishnan who was my pillar..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Assent To Bills: Problems And Justiciability",
    "data": "The problem of delay in according assent to Bills passed by the legislature is a burning issue that confronts our polity and quite often is an affront to our democracy and its fundamentals. Just a couple of days ago, the Supreme Court had to deal with a writ petition challenging the delay in assenting to a Bill by the Governor of Telangana- W.P. (C) No.333 of 2023. The Court disposed of..."
  },
  {
    "headline": "1973 April 26- The Saddest Day In The History Of Our Free Institution",
    "data": "This was the title to a Joint Statement issued by eminent members of the Bar and former members of the Bench.[2] On 26th April 1973—half a century ago today—is the only day in the history of the Supreme Court that the Bar struck and called the action of the Government \"a blatant and outrageous attempt at undermining the independence and impartiality of the judiciary.\"[3]. It was the day..."
  },
  {
    "headline": "‘Surveillance State’ Under Draft Telecommunication Bill, 2022.",
    "data": "Recently, in the month of September, the Ministry of Communication proposed a sunset period for obsolete telecommunication rules by releasing the new draft Telecommunication Bill, 2022. The bill seeks to enable a future-ready framework for the telecommunication sector and stay attuned to the realities of the 21st century. It also aims to upgrade the current regulatory framework in light of..."
  },
  {
    "headline": "Shaping A New Era:  Overhauling India's Antitrust Landscape With The Competition (Amendment) Bill, 2022",
    "data": "On April 3, 2023, the Rajya Sabha approved the Competition (Amendment) Bill, 2022, which is aimed at modernizing the existing anti-trust law that has been in place for two decades, in order to align it with the evolving economic landscape. The Bill was initially presented to Parliament in August 2022 and was subsequently referred to the Standing Committee on Finance for evaluation...."
  },
  {
    "headline": "Golden Jubilee Of Kesavananda Bharati: Celebration And Introspection",
    "data": "This April 24th marks the 50th anniversary of the Kesavananda Bharati judgment which expounded the basic structure doctrine. It is the most celebrated constitutional case of the country. The full court of 13 judges, the largest bench ever-Chief Justice S. M. Sikri and Justices J. M. Shelat, K. S. Hegde, A. N. Grover, A.N. Ray, P. Jaganmohan Reddy, D. G. Palekar, H. R. Khanna, K. K. Mathew, M...."
  },
  {
    "headline": "Master Of Roster Or Judicial Superiority?",
    "data": "The concept of the Master of Roster permits categorization of subject-matters by Chief Justice of India and Chief Justices of High Courts , but unfrotunately this sui generis power is not excersised fairly by few a Chief Justices of High Courts. The system of ‘Master of Roster’ is prevalent in Supreme Court and High Courts for bench allocation. As per the system of..."
  },
  {
    "headline": "SARFAESI Act, 2002, Insertion Of Section 17 (4A) By Way Of  Amendment Act Of 2016 & Its Implication On Rights Of Tenant Under Tenancy Law",
    "data": "Securitization and Reconstruction of Financial Assets and Enforcement of Security Interests Act, 2002 ( in short“SARFAESI”) was enacted to strengthen the Indian banking system by way of efficient or rapid recovery of non-performing assets of the banks and financial institutions which allows banks and financial institutions to auction properties when borrower fail to repay..."
  },
  {
    "headline": "Judicial Intervention In Encounters In India",
    "data": "“It is necessary to know the truth so that the law is tempered with justice.” Extra Judicial Execution Victim Families Assoc.case Last Month, the Supreme Court had refused to entertain the plea of..."
  },
  {
    "headline": "Junior Law Associate Vacancy At Shandilya Law Offices [Apply Now]",
    "data": "Shandilya Law Offices invites applications for the post of Junior Law Associate at their I.P. Extension (Patparganj), Delhi office. Name of the Post: Junior Law AssociateSalary: As per industry standardsEssential Qualification and Experience• A Degree in Law with at least 2-4 years of experience in Litigation.• The candidates should possess strong writing/ analytical skills and should be able to communicate effectively with clients and colleagues.Area of Practice – Litigation, Civil and Criminal, Finance, Dispute Resolution and Matrimonial Disputes, etc.Roles & Responsibilities• The candidates will be drafting and preparing documents, formulating strategies and conducting legal research.How to apply?• Interested candidates are required to submit their CVs along with a cover letter to email id shandilyalawoffices@gmail.com"
  },
  {
    "headline": "Applicability Of Section 10A, IBC To Part Default During Suspension Period ;An Analysis",
    "data": "On 5 June, 2020, the Government of India introduced Section 10A to the Insolvency and Bankruptcy Code, 2016 by the way of an ordinance which barred filing of any application for initiation of CIRP for default occuring during a certain period. The rationale behind the insertion of this section was to prevent the interests of corporate debtors who suffered economic crisis due to..."
  },
  {
    "headline": "Examining The Power Of The Consumer Commissions To Issue A Commission For Expert Opinion",
    "data": "As per Section 38(9)(e) of the Consumer Protection, 2019, corresponding to Section 13(4)(v) of the erstwhile Act of 1986, a District Commission has the same power vested in a Civil Court, under the Civil Procedure Code, 1908, for issuance of a Commission. This provision specifically deals with the power to issue a commission for examination of any witness or any document. The Act however,..."
  },
  {
    "headline": "K G Kannabiran: The Practitioner of Insurgent Constitutionalism | Book Review Of 'The Speaking Constitution'",
    "data": "The character of the Indian state and politics has transformed drastically over the last few years. Mob lynchings, hate speech against minorities, criminalisation of dissent, weaponisation of extant laws against critics, and evisceration of civil liberties, among others, have largely come to constitute the everydayness of India. This transformation, notes Madhav Khosla and Milan Vaishnav in..."
  },
  {
    "headline": "Future Of Property Mortgages On Forest Land",
    "data": "In the event that a bank or financial institution grants a loan to an individual or entity, it is essential that the institution takes appropriate measures to ensure that its \"security interest\" is protected. In addition to evaluating the creditworthiness of the borrower, securing the \"security interest\" is the most significant factor to consider when evaluating a loan application...."
  },
  {
    "headline": "When Neutrality Masks Inequality",
    "data": "Reflection on the current discourse surrounding feminist interpretations attached with the Indian constitution proffers an inkling of cherry-picking aspects on which feminist analysis can even be placed on, constitutional concepts like fundamental rights are often viewed from the feminist lens, which lends an important but often redundant insight into the mechanisms of these fundamental rights..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "A Letter To Prime Minister Modi From Senior Advocate Dushyant Dave",
    "data": "Dear Prime Minister,These path-breaking messages have rightly been described by you, Sir, as inspirations and not merely slogans. You have described this broadly as Secularism in action saying, “Country and its Citizens come First”. You carried this message, and brilliantly too, to the world when in September 2019 you addressed the 74 th United Nations General Assembly Session. You dreamt..."
  },
  {
    "headline": "Relevancy Of Assessment Year For Taxing Foreign Assets And Income Under The Black Money Act - A Legal Conundrum",
    "data": "While presenting the Union Budget in 2015, the then Finance Minister announced, that in order to evade taxes in India some people had stashed away their money outside India (which is commonly referred to as Black Money) and in order to curb this malaise a new legislation will be introduced to tackle the undisclosed assets and income of Indian citizens located outside India. To achieve..."
  },
  {
    "headline": "Shattering The Glass Ceiling: A Tribute To Ruth Bader Ginsburg",
    "data": "“I ask no favour for my sex. All I ask of ourbrethren is that they take their feet off our necks.”Amit A. Pai[1] & Pankhuri Bhardwaj[2]The iconic and inspirational life and journey of Justice Ruth Bader Ginsburg has been well documented in several articles and books. The second woman to be elevated to the Supreme Court of the United States, she was a champion for the cause of..."
  },
  {
    "headline": "Israel’s Judicial Reform Bill: A Threat To Judicial Independence & Democracy?",
    "data": "On February 20, 2023, two bills that aim to \"overhaul Israel's judiciary\" were approved by a vote of 63 to 47 in the 120-member Parliament of Israel, just barely after midnight. In the middle of continuous demonstrations in which tens of thousands of Israelis assembled on the streets and blocked highways heading towards the capital city of Jerusalem, the far-right government..."
  },
  {
    "headline": "Environment Protection And Liability: The Offence Concerning Legalized Nuisance And Injustice",
    "data": "Needless to say, environmental law is a sort of a separate entity from the discipline of environmental justice. Environmental justice in itself an absolute meaningful directive to attend to the equitable development of humans as capital and as workforce irrespective of any kind of discrimination. Environmental Justice is defined as equitable exposure to environmental good and..."
  },
  {
    "headline": "The Competition (Amendment) Bill 2023: Will It Pass The Test Of Constitutionality?",
    "data": "On March 29, 2023, the Competition Law (Amendment) Bill, 2023, was passed in Lok Sabha. The aim of this bill is to make additional amendments to the Competition Law (Amendment) Bill, 2022, based on the recommendation proposed by the Standing Committee on Finance. The most crucial change that government has proposed is to increase the methodology for imposing penalties on the..."
  },
  {
    "headline": "The Tale Of Separation Of Powers;  Appointment of  Election Commission",
    "data": "The Supreme Court of India (SC), in the case titled Anoop Baranwal v. Union of India, has directed a change in the appointment mechanism of the Chief Election Commissioner (CEC) and Election Commissioners (EC). The current procedure entails the President appointing the CEC on the aid and advice of the Council of Ministers. The SC has ordered that until the Parliament enacts a law in..."
  },
  {
    "headline": "Can Trial Court Accept Evidence In Sealed Cover In A Criminal Trial?",
    "data": "Recently, the Hon’ble Chief Justice of India, D.Y Chandrachud, once again reignited the debate around sealed covers by denying to accept information in sealed cover note submitted by the Central Government in the matter relating to OROP. While the debate around the practice of acceptance of evidence in sealed cover has been a long existing one. This debate has been primarily focused on..."
  },
  {
    "headline": "Small Shareholders Director Under The Companies Act, 2013",
    "data": "The concept of small shareholder director was introduced to safeguard the interests of small shareholders in a company. The appointment of a small shareholder director is a measure taken to ensure that the small shareholders of a company are adequately represented and to prevent the board of directors from taking any decisions that are detrimental to the interests of..."
  },
  {
    "headline": "Critically Analysing The Interpretation And Application Of The Definition Of Pre-Packaged Commodity",
    "data": "The Origin of modern legal metrology can be traced back to 18th century France with the introduction of decimal metric system for trade. In 1875, Treaty of Meter was enacted to bring international uniformity and precision of standards of weights and measures. This also resulted in establishment of International Committee of Weights and Measures and the National Measurement Initiatives in..."
  },
  {
    "headline": "Questioning State Is Not 'Anti-National' : Senior Advocate KV Viswanathan Writes About Law Minister's Comments",
    "data": "When India’s Union Law Minister describes retired judges in a rather harsh manner, it is something that cannot be taken lightly. For the Minister to label retired judges who question “state policies” as being “anti-India” elements is not just a case of a flawed understanding of concepts but also a matter of grave concern for citizens.The Minister’s parting shot, based on the..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Need For An Ethical Framework On Usage Of Generative AI In The Legal Realm",
    "data": "Generative AI chatbots, such as ChatGPT and Bing Chat, is one of the most remarkable advancements in the line of language processing applications. With an estimated user base of 100 million just two months after it was first launched, ChatGPT is also one of the most quickly adopted innovations in history. The alluring feature of generating detailed text outputs with nothing but a prompt or..."
  },
  {
    "headline": "Consumer Protection And The Law Of Insurance",
    "data": "The term Insurance refers to a shield against the risks involved in the various market investments. Insurance is a type of contractual arrangement also referred to as Policy arrangement in a form of guarantee or Indemnity where one party through a form of Contract agrees to provide surety or indemnity against the loss of third person. Undoubtedly Insurance come as a big relief during..."
  },
  {
    "headline": "The Implications Of Remorse In The Sentencing Stage Of A Death Penalty Case",
    "data": "Expressing remorse/repentance is widely held to be a part of the moral character of an accused in contrast to bad character for which he is punished.[1] Consideration of remorse as an aggravating or mitigating factor at the time of sentencing has been an area of debate which has produced diverse opinions. While implication of presence of remorse is explicitly dealt with at the..."
  },
  {
    "headline": "The Override Clause-  Israel’s Quest For Its Kesavananda",
    "data": "It is a turning moment in the constitutional history of Israel, it is a Kesavananda Bharti-like opportunity to protect and preserve the basic tenets of democracy. The city of Tel Aviv is gathered by thousands of people protesting on the streets for what they call ‘standing up for democracy’. Protests have been going on in the national capital for nine weeks, against the action..."
  },
  {
    "headline": "International Child Removal To India And The Balancing Factors In A Writ Of Habeas Corpus: Show Me The ‘Baby’",
    "data": "Indian case law extensively covers matters concerning international parental child removal to India from a foreign country. Typically, such disputes arise when one parent (the “taking parent”) removes the child from his or her home country without the knowledge or consent of the other parent (the “left-behind parent”). India has not signed the Hague Convention of 25..."
  },
  {
    "headline": "Section 27 of Evidence Act For More Lucidity",
    "data": "Read this in continuation of the Article “Section 27” Of The Evidence Act And The Verdict In “Pulukuri Kottaya” Continue To Elude The Comprehension Of Many Judges At All Levels\"If the “information” to be received from an accused person in the custody of a Police Officer should be regarding a “fact discovered”, ANDIf the words..."
  },
  {
    "headline": "Rahul Gandhi’s Conviction And Disqualification Are On Questionable Grounds",
    "data": "The conviction of former Congress Member of Lok Sabha, Rahul Gandhi by a Surat court for criminal defamation (Purnesh Modi vs Rahul Gandhi) has led to a debate on whether what he said, in the course of an election speech in 2019, constitutes an offence under the law. The constitutional validity of Sections 499 and 500 of the Indian Penal Code and Sections 199(1) and 199(4) of the CrPC was..."
  },
  {
    "headline": "Courts In Rajasthan To Continue Restrictive Functioning Until Further Orders [Read Notification]",
    "data": "In view of subsistence of the nationwide lockdown, the Rajasthan High Court has decided to continue restrictive functioning, both in the High Court as well as in the Subordinate courts, until further orders. It is intimated that the Benches will function between 08:30 AM and 12:30 PM. with half an hour break from 10:00 AM to 10:30 AM. Special Courts/Tribunals will also function between..."
  },
  {
    "headline": "Broadening Powers Of DG: Dawn Raids And The CCI’s Responsibility",
    "data": "Raids, conducted by government officials are intended to collect incriminatory evidence against an entity or individual accused of committing act(s) which are in contravention of law. However, the procedure required under numerous statutory provisions makes it too obvious for the entity before the same is conducted thereby providing it necessary opportunity to hide, tamper or..."
  },
  {
    "headline": "Supreme Court’s Curative Order Has Made Justice For Bhopal Gas Tragedy Survivors Even More Elusive",
    "data": "The Supreme Court’s March 14 order in Union of India & Others vs Union Carbide Corporation & Others, dismissing the curative petitions seeking reexamination of the settlement amount, reached in 1989, following the Bhopal gas disaster in 1984, raises serious questions about the Court’s approach to the survivors’ grievances.The Constitution Bench, comprising Justices Sanjay..."
  },
  {
    "headline": "The Minimum Wage Security Jurisprudence",
    "data": "In the current article the various facets of minimum wage and how it is understood by the various schools of thought is analyzed. Further the article also ponders over the debate as to the rightfulness and the worthiness of minimum wage laws and its necessity in the current economic situation. Moreover, the article also discusses the jurisprudential aspect of minimum wage and more precisely..."
  },
  {
    "headline": "Recent Appointments To Higher Judiciary: Time To Make Informal Criteria Transparent",
    "data": "One advantage of researching the background of those being appointed to the Supreme Court is the insights they yield regarding the role of pedigree in their success at every stage in their long judicial careers. Four out of the eight recent appointees to the Supreme Court -about whose family background information is available in the public domain - belong to reputed legal families,..."
  },
  {
    "headline": "A Long-Standing Discord On Article 282",
    "data": "The concept of freebies has become a buzzword with the preponderance of promises made by political parties. Promises or distribution of free electricity, free water supply, etc. have become commonplace in the Indian political milieu. In light of the above events, a few months ago, a PIL petition was filed to oppose the practice of political parties promising freebies. The petitioner..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "What is Surrogate Advertising?",
    "data": "Surrogate advertisements are essentially a substitute advertisement for the goods which cannot be directly advertised due to the prohibition of law, the goods that form the corpus of such prohibition are: tobacco products, Alcohol, Narcotic substances and other such products. Why does a brand invest large sum of money on a brand extension which is rarely marketed? Or why is a..."
  },
  {
    "headline": "World Consumer Rights Day: Recent Important Supreme Court Judgments on Consumer Protection Law",
    "data": "“Customers are the most important visitor on our premises, they are not dependent on us, we are dependent on them. They are not an interruption in our work. They are the purpose of it. They are not outsiders in our business. They are part of it; we are not doing them a favour by serving them. They are doing us a favour by giving us an opportunity to do so.” – Mahatma Gandhi.The..."
  },
  {
    "headline": "Indian Law And Toxic Fumes-The Need To Reconsider Vape Law",
    "data": "With the Incremental upsurge in the usage of Electronic Cigarettes and Vapes among Youth in the past years, the Government of India responded by banning the same in 2019, through the Prohibition of Electronic Cigarettes Act 2019[1]. The ban was based on the recommendations of the Indian Council for Medical Research, the top body for the formulation, coordination and promotion of..."
  },
  {
    "headline": "The Case For Regulating, Not Banning Bike Taxis",
    "data": "The bike taxi sector in India is currently valued at USD 50.5 Million and is expected to grow to USD 1.4 Billion by 2030. The reason for this growth lies in bikes being an economical alternative to all other types of taxis. However, this aggressively expanding industry has been facing its fair share of regulatory struggles. On 19th February 2023, the Delhi government issued..."
  },
  {
    "headline": "Section 156(3) R/W 397 Of Criminal Procedure Code: A Pillar To Post Provision(?)",
    "data": "The Code of Criminal Procedure (“Code”) provides a supplementary way to report a cognizable offence. Under Section 156(3), the Magistrate has the competence to order an investigation of an offence of which he may have taken cognizance under Section 190. Ergo, any application of Section 156(3) can only be at the pre-cognizance stage. Section 156(3) empowers a Magistrate to..."
  },
  {
    "headline": "Black, White and Red – The Curious Case Of Court Complexes And Washroom Equity For Women in India",
    "data": "Recently, the Minister for Higher Education and Social Justice in the State of Kerala, Dr. R. Bindu, had declared that necessary steps would be taken in order to implement menstrual leave in all universities in the State, having regard to “the mental and physical difficulties faced by female students during menstruation”. When a PIL in this regard had been filed by..."
  },
  {
    "headline": "International Women’s Day: Recent Important Supreme Court Judgments On Women’s Rights",
    "data": "“Honesty, pride and self-esteem are crucial to the personal freedom of a woman. Social progress depends on the progress of everyone. Following words of the father of our nation must be noted at all times: To call woman the weaker sex is a libel; it is man's injustice to woman. If by strength is meant moral power, then woman is immeasurably man's superior. Has she not greater intuition, is..."
  },
  {
    "headline": "Spotlight On Recent Appointments To Supreme Court - Justice Ahsannuddin Amanullah",
    "data": "A general criticism of the Indian Courts has been that very little is known to the public about the judges being recommended by respective Collegium before their appointment, on merit and suitability. A designated Secretariat ideally should do the job, unfortunately we don’t have such a mechanism. Livelaw has taken an initiative to share relevant information about the appointees and we..."
  },
  {
    "headline": "Courts In Rajasthan To Continue Restrictive Functioning Until Further Orders [Read Notification]",
    "data": "In view of subsistence of the nationwide lockdown, the Rajasthan High Court has decided to continue restrictive functioning, both in the High Court as well as in the Subordinate courts, until further orders. It is intimated that the Benches will function between 08:30 AM and 12:30 PM. with half an hour break from 10:00 AM to 10:30 AM. Special Courts/Tribunals will also function between..."
  },
  {
    "headline": "Why The Workplace Sexual Harassment Law In India Is Focused On Women?",
    "data": "At outset, I would like to clarify the nowhere the article is in denial of the fact that individuals not assigned female sex at birth and those who do not identify themselves as women are not victims of workplace sexual harassment. Also, it is important to recognise that complaints from them need to be acknowledged and redressed through mechanisms within organisations. However, the article is..."
  },
  {
    "headline": "“Section 27” Of The Evidence Act And The Verdict In “Pulukuri Kottaya” Continue To Elude The Comprehension Of Many Judges At All Levels",
    "data": " A “confession” made to a “police officer”, by a person (presently or subsequently) accused of an offence cannot be proved against him and is, therefore, inadmissible in evidence before a Court of law in view of Section 25 of the Indian Evidence Act, 1872 (“Evidence Act” for short). Similarly, a confession by a person (presently or subsequently) accused of an offence and made..."
  },
  {
    "headline": "Spotlight On Recent Appointments To Supreme Court: Justice PV Sanjay Kumar",
    "data": "A general criticism of the Indian Courts has been that very little is known to the public about the judges being recommended by respective Collegium before their appointment, on merit and suitability. A designated Secretariat ideally should do the job, unfortunately we don’t have such a mechanism. Livelaw has taken an initiative to share relevant information about the appointees and we..."
  },
  {
    "headline": "Supreme Court Judgement In Balram Singh vs. Kelo Devi - A Critique",
    "data": "Whether the legal proposition laid down by the Supreme Court in Balram Singh vs. Kelo Devi [2022 LiveLaw (SC) 800] prescribing a blanket bar in passing a decree for specific performance of a contract based on an unregistered document/ agreement to sell immovable property is a dictum applicable pan India? This question has been raised by many in the legal fraternity.In Balram Singh, a..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Restrictive Interpretation To Section 438 Of The Code Of Criminal Procedure",
    "data": "The High Court of Allahabad has held that (Rajesh Kumar Sharma Vs. C.B.I.)[1] the application for anticipatory bail (Sec 438 CrPc) shall not be maintainable if the person is already arrested and is in custody in relation to a different case. For arriving at the conclusion, the court has wrongly relied upon the judgments of the Rajasthan High Court in Sunil Kallani vs State of..."
  },
  {
    "headline": "Exclusionary Conduct Of Competition Law In India And The Jurisprudence Behind It",
    "data": "Anti-trust laws are essentially the Magna Carta of free enterprise. In principle, the aim of anti-trust laws is to protect the integrity and core of free market in an economy by protecting dissipation of monopolistic power in the hands of dominant individual enterprises and protecting consumer interests in the process. However, dwelling into the jurisprudential context of why and how..."
  },
  {
    "headline": "Is Artificial Intelligence The Next Big Thing In The Field Of Law?",
    "data": "It’s nothing but a paradox. We often talk about the Justice system as an antidote to human failures - the duty of the state to punish perpetrators of crime who often give in to intense passions of jealousy, deceit and misdemeanour. But what if this very system of justice is unable to maintain fairness and reeks of another human failing – biasness? What if the system, to begin with,..."
  },
  {
    "headline": "Need To Stop Hate Speech On TV News Channels",
    "data": "How many times have you taken off anchors? Have you dealt with anchors in the way you send a message?” These questions were asked by the Supreme Court (SC) from News Broadcasting Standards Authority (NBSA) while hearing a batch of cases involving allegations of hate speech. This evidently shows the anxiety of the SC on absence of any institutional mechanism to regulate the TV..."
  },
  {
    "headline": "10 Important Data Protection Practices To Keep In Mind For A Startup In India",
    "data": "Recent years have seen a digital boom worldwide resulting in the explosion of digital data collection and distribution. This issue has raised the important question of how to deal with this huge amount of data being collected by the companies all over the world. Various countries have formulated laws in order to deal with the issues of data privacy and data protection. India has come..."
  },
  {
    "headline": "Payment Of EPF Dues Under The IBC – Supreme Court Paves Way For Full Realization",
    "data": "In Ghanshyam Mishra and Sons Pvt. Ltd. v. Edelweiss Asset Reconstruction Company Ltd. , the Supreme Court had clarified that any claim not approved under the resolution plan by the Adjudicating Authority shall stand extinguished. The Apex Court had upheld the Insolvency and Bankruptcy Code (Amendment) Act, 2019 wherein the governmental authorities had been classified within the..."
  },
  {
    "headline": "Care, Rights of Abortion Survivors",
    "data": "The Indian Judiciary in accord to ascertain women’s rights or equality rights strives to locate the possibilityof abortion even after the gestation limit of 24 weeks under section 3(2)(b) of the Medical Termination of Pregnancy (Amendment) Act, 2021. What if the child so aborted is born alive? The enigma is to balance — the rights of women i.e., “pro-choice” and rights..."
  },
  {
    "headline": "Discretionary Power of Arrest Under Section 41A Of The CrPC",
    "data": "Section 41-A CrPC was aimed to avoid unnecessary arrest or its threat looming large on the accused which required to be vitalised. Section 41-A as inserted by Section 6 of the Code of Criminal Procedure (Amendment) Act, 2008 (5 of 2009), However after the enactment of the said amendment, various representations were received by the Union Government, Thus, some specific amendments..."
  },
  {
    "headline": "Can NCLT Conduct A Full-Fledged Trial?",
    "data": "Tribunals have always had an urban legend surrounding them that their proceedings are only summary in nature and they can render only prima-facie findings and are devoid of jurisdiction while adjudicating a matter revolving disputed facts. The perception concerning National Company Law Tribunal (“NCLT”) finds no exception to this. To uncover the same, this article attempts to..."
  },
  {
    "headline": "The Designer Baby Quandary- An Insight Into Gene Editing And Its Legality",
    "data": "Gene editing or genome editing, a type of genetic engineering is a method of altering an organism’s DNA. it may involve adding, removing or altering the genetic material in the genome. A prominent one among the various developed approaches is the CRISPR-Cas9 (Clustered regularly interspaced short palindromic repeats) approach. The prominence of this approach emerges from its..."
  },
  {
    "headline": "Surveys, Searches And Seizures: Some Constitutional Dimensions",
    "data": "Traditionally, under the law and the Constitution, the process of search and seizure by authorities was legal only when backed by a warrant showing probable cause. This principle is the bedrock of individual liberty and privacy against the tyrannical state in the common law world. In the words of Lord Camden in 1763 in Huckle v. Money, “To enter a man's house by virtue of a..."
  },
  {
    "headline": "Election Commission & Dissent Within Political Parties, Time To Consider Reform Of Anti-Defection Laws",
    "data": "The Election Commission decided to reserve the “Bow & Arrow” symbol to the Maharashtra Chief Minister, Eknath Shinde’s faction of the Shiv Sena while the Supreme Court deferred the reference to a seven-judge bench of the question ‘whether the Speaker can adjudicate disqualification petitions under the Tenth Schedule - if the motion for her removal from the office is pending before..."
  },
  {
    "headline": "Courts In Rajasthan To Continue Restrictive Functioning Until Further Orders [Read Notification]",
    "data": "In view of subsistence of the nationwide lockdown, the Rajasthan High Court has decided to continue restrictive functioning, both in the High Court as well as in the Subordinate courts, until further orders. It is intimated that the Benches will function between 08:30 AM and 12:30 PM. with half an hour break from 10:00 AM to 10:30 AM. Special Courts/Tribunals will also function between..."
  },
  {
    "headline": "Whether Cooperative Societies Come Under The Purview Of Sec. 2(H) Of RTI Act, 2005?",
    "data": "It has long been a matter of debate whether a cooperative society would be subject to the requirements to provide information under the RTI Act and fall under the definition of \"public authority\" as per Section 2(h) of the said Act. Before delving into the nuances of the subject, lets understand what a cooperative society is. “A co-operative association is a union of..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "“Can Slogans/Tag Lines Be Copyrighted In India Or Abroad?”",
    "data": "Many brands, during business, compose and develop phrases or catchy combination of words with a view to create a lasting impression in the minds of the consumers, to augment popularity of their goods and/or services. These phrases essentially constitute of a slogan or tagline associated with the said product or service and are used for the purposes of advertising or expanding..."
  },
  {
    "headline": "Antrix-Devas Dispute: Will The Anti-Arbitration Injunction Order Turn The Chain Of Events In Favour Of India In The New BIT Arbitration",
    "data": "Recently, the Indian government achieved a major victory in its third treaty arbitration dispute with Devas Multimedia, as the Supreme Court of Mauritius barred Devas from proceeding with its latest arbitration proceedings against India. Judge Prameeta Goordyal-Chittoo issued the interim order on 12th January 2022, prohibiting the three Mauritius-based Devas investors from..."
  },
  {
    "headline": "Trade Union Recognition Under The Industrial Relations Code,2020, Needs Introspection",
    "data": "According to the International Labour Organization , collective bargaining can be defined as “the key means through which employers and their organizations and trade unions can establish fair wages and working conditions.” Though the Indian Constitution doesn’t explicitly provide for a fundamental right of collective bargaining, the Supreme Court held in All India Bank Employees..."
  },
  {
    "headline": "Protection Of Minority Shareholders And Related Party Transactions",
    "data": "The Company is an artificial entity incorporated under the Companies Act, 2013[1] (hereinafter, ‘Company Act’), and conducts its affairs through its board of directors who owe a duty to take care towards all the stakeholders of the company and to conduct the affairs of the company in a neutral and unbiased manner. Shareholders of a Company can be in broad terms divided into..."
  },
  {
    "headline": "Section 27 Of The Evidence Act Re-Visited In The Wake Of Supreme Court Judgement In “Ramanand @ Nandlal Bharti”",
    "data": "Any discussion on Section 27 of the Indian Evidence Act, 1872 will be incomplete without reference to Sections 25 and 26. Section 25 of the Evidence Act prohibits proof of “confession” made to a police officer by an accused person. Section 26 interdicts proof of a “confession” made by an accused person while he is in the custody of a police officer. Section 27 which is in the form of..."
  },
  {
    "headline": "Socialism And Stock Market Meet At Social Stock Exchange",
    "data": "The Hon’ble Finance Minister, as part of the Budget Speech for the Financial Year 2019 -2020 had proposed to initiate steps towards creating a Social Stock exchange in India, under the regulatory ambit of Securities and Exchange Board of India (“SEBI”), for listing of social enterprises and voluntary organizations. In the budget speech, the Hon’ble Finance Minister..."
  },
  {
    "headline": "Valentine’s Day : Right to Love & Indian Supreme Court",
    "data": "Valentine’s Day is upon us again. It is a holiday of mysterious provenance but has come to widely represent a festival of love and devotion (not to mention, consumerism) that is celebrated and dreaded in equal measure. Whether you have a significant other, are (un)happily unattached, think Valentine’s Day is nothing more than a grotesque capitalistic spectacle, or rail against..."
  },
  {
    "headline": "Justice S.Abdul Nazeer’s Appointment As The Governor Without A Cooling-Off Period Brings It Under Scrutiny",
    "data": "The news that the former Judge of the Supreme Court, Justice S. Abdul Nazeer, who retired on January 4, has been appointed as the Governor of Andhra Pradesh, should cause concern to all those who value judicial accountability and reputation.Although it is not the first time that a former Judge of the Supreme Court has been appointed as the Governor of a state, this is the first time that a..."
  },
  {
    "headline": "India’s Environment Laws Need Stronger Implementation",
    "data": "Those examining the effectiveness of India’s environmental laws are often troubled by its “implementation curse”. While the legislature has time and again promulgated laws and laid down extensive guidelines to ensure protection of the environment from capitalistic exploitation, there seems to be a massive failure on part of the Executive to strictly enforce these environmental laws..."
  },
  {
    "headline": "Brave Lawyer Who Sacrificed His Life For Innocents : Remembering Shahid Azmi On His 13th Death Anniversary",
    "data": "\"I’ve died a hundred times and if death did come knocking, I would look it in the eye\", said Late Shahid Azmi, who was shot dead on this day in 2010 in his chamber. In his practice of about seven years, Azmi fought numerous cases and represented those whom he believed were wrongly accused in several high-profile “terror cases” in Mumbai. In his short span of around seven..."
  },
  {
    "headline": "In Anna Mathew, the Supreme Court Did Not Follow Its Own Precedents",
    "data": "In its reasons for rejecting on February 7, the petitions seeking ex parte injunction against the swearing-in of Justice L.C. Victoria Gowri as a Judge of the Madras High Court, the Supreme Court’s two judge bench, comprising Justice Sanjiv Khanna and Justice B.R.Gavai, has on Friday, rejected the argument of the petitioners that the facts were not known and considered by the Collegium...."
  },
  {
    "headline": "Courts In Rajasthan To Continue Restrictive Functioning Until Further Orders [Read Notification]",
    "data": "In view of subsistence of the nationwide lockdown, the Rajasthan High Court has decided to continue restrictive functioning, both in the High Court as well as in the Subordinate courts, until further orders. It is intimated that the Benches will function between 08:30 AM and 12:30 PM. with half an hour break from 10:00 AM to 10:30 AM. Special Courts/Tribunals will also function between..."
  },
  {
    "headline": "Secured Creditors Vis-À-Vis Debt Recovery: A Positive Step",
    "data": "The creation of statutory charges and the subsequent recovery process initiated by the tax department has often clashed with the recovery mechanisms used by secured creditors like banks under the Securitization andReconstruction of Financial Assets and Enforcement of Security Interest Act,2002 (“SARFAESI”) and Recovery of Debts Due toBanks and Financial Institutions Act, 1993..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "How Much Sunlight? Debating Collegium Transparency | Column By Sr Adv Sanjoy Ghose",
    "data": "Recently, the statements issued by India’s Supreme Court disclosed extracts of Intelligence Reports forwarded by the Government to the Collegium to substantiate its veto on certain candidates recommended for judicial appointment. The Law Minister responded by voicing an alarm about the sensitivity of the intelligence shared.This has again brought to the centre stage the issue of..."
  },
  {
    "headline": "The IBC VS. SEBI: Critical Analysis Of Moratorium Under IBC",
    "data": "Section 28A of the Securities and Exchange Board of India Act, 1992 (“SEBI Act”) mentions about the recovery of proceeds from debtors in the form of attachment of immovable and movable property, attachment of bank accounts, etc. in order to make good the penalty imposed or to ensure the compliance with the regulations and the directions of the SEBI. However, this provision of SEBI..."
  },
  {
    "headline": "In The Light Of Victoria Gowri’s Swearing-in As A Judge, Grounds For Judicial Review Of Her Appointment Still Persist",
    "data": "With the Supreme Court on Tuesday not entertaining the petitions challenging the appointment of advocate Victoria Gowri as an Additional Judge of the Madras High Court, and following her swearing-in as the Judge, it would be naive to assume that the petitioners have exhausted their legal remedies in this case. The two-Judge bench comprising Justice Sanjiv Khanna and B.R.Gavai,..."
  },
  {
    "headline": "Right To Personality And Its Emergence In India",
    "data": "Right to Personality has recently been in the news as the aspect of the case is concerned with constitutional law and publicity rights. The reason is that the Delhi High Court recently passed an interim order restraining the unlawful use of the renowned actor of Bollywood Amitabh Bachchan’s name, image, and voice. The court by this order restrained the respondent and other persons..."
  },
  {
    "headline": "Victoria Gowri’s Elevation Exposes Centre’s Double Standards & Collegium’s Fiasco",
    "data": "A person who has a record of making deeply problematic communal statements is now a High Court judge. The appointment of Victoria Gowri as an additional judge of the Madras High Court will remain an ignoble chapter in the Indian judicial history. It raises troubling questions at the efficacy of the selection process- which boasts of consultations at multiple levels - in picking up the..."
  },
  {
    "headline": "The Judge Is Not A Mere Post Office To Frame The Charge At The Behest Of The Prosecution – The Discharge Of Accused In The Jamia Violence Underscores",
    "data": "The Additional Sessions Judge, South East District, Saket Court, Arul Varma, in State vs Mohd. Ilyas@ Illen, delivered an order on Saturday, which is significant for establishing when an assembly of persons protesting against what is perceived as unjust, becomes illegal. The order is also noteworthy to ascertain whether the action taken by the police against individuals exercising..."
  },
  {
    "headline": "Law On Reels; Rashomon In The Courtroom-Exploring The Paradox Of Subjectivity In Legal Proceeding",
    "data": "A notable quote by author Mark Twain reads the following: “Truth is stranger than fiction, but it is because fiction is obliged to stick to possibilities; the truth is not.” Generally, it shows situations where the truth appears implausible based on facts and circumstances. Legendary director Akira Kurosawa employs a criminal thriller story in his epochal film Rashomon in 1950..."
  },
  {
    "headline": "To Interfere Or Not To Interfere – The Section 11 Conundrum",
    "data": "The Courts under Section 11 of the Arbitration and Conciliation Act, 1996 (‘the Act’), are empowered to intervene if the parties fail to agree on the appointment procedure or are unable to act upon the agreed appointment procedure. Some argue that the Court should limit its examination to the existence of an arbitration agreement and refer the matter to arbitration by appointing..."
  },
  {
    "headline": "If Circumstances Warrant, A Judge, Wrongly Appointed, Does Not Become Immune From Action: Supreme Court In 2008",
    "data": "As the Supreme Court is set to hear petitions challenging the appointment of L.Victoria Gowri as a Judge of the Madras High Court today, it has to come to terms with its own judgment, delivered in 2008 with respect to the appointment of another Judge of the Madras High Court, which was under challenge then. In Shanti Bhushan and Another vs Union of India, Justices Arijit Pasayat..."
  },
  {
    "headline": "Cape Town Convention – A Masterpiece For Aviation Transactions",
    "data": "In the age of technology, when air space is dominated by the presence of different kinds of aerial vehicles, it becomes important to address queries originating from Aviation asset financers/stakeholders. One of the major demand comes from creditors & lessors seeking development of a mechanism, to regulate asset based leasing and finance of aviation tools and thereby cap the..."
  },
  {
    "headline": "Odour And The Law",
    "data": "Odour - a strong, mostly unpleasant smell - has proven to be a nuisance on several occasions in India. Undesirable odour is often indicative of an environmental problem that impacts health and human well-being. Like how, notably, in 1858, it was the “Great Stink” of the polluted Thames River and not the contagious diseases being spread that prompted the UK Parliament to take action..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Judicial Appointments: Unhealthy Debate On Misplaced Concern",
    "data": "The Union Law Minister’s public comments about appointment of judges and the judicial pendency, though, raise genuine concerns about the system of administration of justice in India but probably though inappropriate forum and for sure a misplaced concern. The concern should be the qualitative and quantitative improvement of Judgeship in India. These issues undoubtedly warrant..."
  },
  {
    "headline": "Remembering Shanti Bhushan : A Look At Notable Cases Fought By Him",
    "data": "Acclaimed lawyer and Senior Advocate Shanti Bhushan passed away at his home in Delhi at 7PM on 31st January. He was aged 97 years. Shanti Bhushan also served as the Union Law Minister from 1977 to 1979 during the post-emergency era in the Morarji Desai government. During his illustrious career that ran for over six decades, Bhushan was not just a part of but also pivotal to several..."
  },
  {
    "headline": "Siddique Kappan’s Release On Bail After 846 Days Is A Harsh Reminder Of What Can Happen To Our Precious Freedom",
    "data": "Eternal vigilance, it is said, is the price of liberty. Siddique Kappan’s loss of liberty for 846 days shows that our liberty too can be snatched by the State for no reason. On being released on bail from a Lucknow prison on Thursday, Kappan told the media that he had no idea why he was implicated wrongly in a case and jailed for 28 months. That he has been only released on bail..."
  },
  {
    "headline": "Applicability Of The POCSO Act On The Consensual Relationship Between The Minor",
    "data": "Recently the CJI D.Y. Chandrachud has urged the parliament to reconsider the age of consent under the Protection of Children from Sexual Offences Act, 2012 (POCSO) he stated that major difficulty encountered in POCSO cases by the Judges is in situations where the consent is factually present but regardless of it since the POCSO criminalizes all the sexual acts among those under 18 years..."
  },
  {
    "headline": "The Outer Space Treaty",
    "data": "It has been more than 55 years since the Outer Space Treaty came into picture. The Treaty was opened for signature by the three depository Governments (the Russian Federation, the United Kingdom and the United States of America) in January 1967, and it entered into force in October 1967. The treaty provides the basic framework of the international space law. As per the United Nations..."
  },
  {
    "headline": "On First Principles, SC Collegium’s Recommendation To Elevate A Party Leader As A High Court Judge May Be Flawed",
    "data": "The Supreme Court Collegium, even while appearing to stand up to the Government in the ongoing tug of war for primacy over appointments of Judges to the Higher Judiciary, may actually be losing the perception battle with regard to adherence to the first principles.One such first principle is that candidates, who openly owe allegiance to political parties, ought not to be considered for..."
  },
  {
    "headline": "Courts In Rajasthan To Continue Restrictive Functioning Until Further Orders [Read Notification]",
    "data": "In view of subsistence of the nationwide lockdown, the Rajasthan High Court has decided to continue restrictive functioning, both in the High Court as well as in the Subordinate courts, until further orders. It is intimated that the Benches will function between 08:30 AM and 12:30 PM. with half an hour break from 10:00 AM to 10:30 AM. Special Courts/Tribunals will also function between..."
  },
  {
    "headline": "Key Aspects And Analysis Of Union Budget 2023",
    "data": "The Union Finance Minister Ms.Nirmala Sitharaman has presented the budget for the year 2023-24, the last full budget before the 2024 polls. Various amendments have been proposed for the taxpayers specifically the middle and the salaried class such as altering the tax slabs and increase of rebate for taxpayers paying tax under the new tax regime.Major direct-tax amendments as proposed in..."
  },
  {
    "headline": "Saving The Claims: Excluding Time Spent In Pre-Arbitration Mechanisms From The Period Of Limitation",
    "data": "Pre-arbitration mechanisms refer to dispute resolution mechanism whereby the parties make an attempt to resolve their dispute or grievances without formally invoking the arbitration. It can be by way of mutual talks, mediation/conciliation, or through an internal dispute redressal body. It is now common practice for the parties to a commercial contract to provide for an attempt..."
  },
  {
    "headline": "Shanti Bhushan’s Indelible Legacy Will Continue To Inspire Those Who Campaign For Accountability",
    "data": "If there is one phrase which could sum up the life and career of the eminent lawyer and former Union Law Minister, Shanti Bhushan who passed away on Tuesday, it is his zeal and passion for seeking accountability from the executive as well as the judiciary. His legal acumen was a means to this end. Shanti Bhushan was born in Bijnor, a district town of Western Uttar Pradesh,..."
  },
  {
    "headline": "The Unread Judgments on Gandhi's Assassination",
    "data": "Seventy five years ago, Nathuram Godse pumped three bullets into the chest of Mahatma Gandhi. The investigation, trial, appeal to the high court and appeal to the privy council were all completed with remarkable speed, in 20 months. A study of the judgments is rewarding for legal historians, and for collectors of trivia. For reasons of space, we are not going into the details of the..."
  },
  {
    "headline": "Crown Debt Vs Other Debts – The Legislative Intent",
    "data": "When the Insolvency and Bankruptcy Code,2016 was passed by the Indian Parliament, it created a new precedent by lowering the priority of payment of the Crown Debt or the Statutory Dues to the dues of the Banks/Financial Institutions and other creditors, both secured and unsecured. It was a departure from the long-standing practice set in place by the Britishers from pre-independence..."
  },
  {
    "headline": "Making Cinema Accessible To Everyone",
    "data": "The Delhi High Court on January 16, directed the producers of the upcoming movie ‘Pathaan’ (Yash Raj Films), to make the movie accessible for hearing and visually-impaired persons. The producers of the film were directed to include audio description, close captioning and subtitles for the movie's over-the-top (OTT) release. This is a welcome step but more needs to be done..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Basic Structure And Constituent Power",
    "data": "Recently the comment made by the Vice President of India that the basic structure doctrine as expatiated by the Supreme Court in Keshavananda Bharti case[1] hinders the functioning of the Parliament, evoked a flurry of responses. What Keshavananda held was that Parliament can amend any part of the Constitution save the basic structure. Now when we ask ‘what is basic structure?’..."
  },
  {
    "headline": "How Pakistan’s Ruling Classes  Destroyed Their Judiciary And Their  Democracy",
    "data": "The Indian judiciary has, of late, come under relentless pincer like attacks from several quarters of the ruling establishment. Repeated pot shots, (deliberately ignoring historical and structural contexts) have been made against the collegium system of appointments, the basic structure of the constitution and calls are even being made for an unaccountable supremacy of the Parliament...."
  },
  {
    "headline": "Justice Madan Lokur’s Judgment In NJAC Case Has The Key To Recent Irritants Between Executive And The Judiciary",
    "data": "As the nation celebrates 74th Republic Day on Thursday, the ongoing stand-off between the Union Government and the Supreme Court Collegium over the appointment of Judges shows that Article 50 of the Constitution - a Directive Principle which calls upon the State to take steps to separate the judiciary from the executive in the public services of the State - is under severe stress. ..."
  },
  {
    "headline": "Courts In Rajasthan To Continue Restrictive Functioning Until Further Orders [Read Notification]",
    "data": "In view of subsistence of the nationwide lockdown, the Rajasthan High Court has decided to continue restrictive functioning, both in the High Court as well as in the Subordinate courts, until further orders. It is intimated that the Benches will function between 08:30 AM and 12:30 PM. with half an hour break from 10:00 AM to 10:30 AM. Special Courts/Tribunals will also function between..."
  },
  {
    "headline": "74th Republic Day : Lets Build A 'Constitutional Democracy' And Not A Mere 'Democracy'",
    "data": "Thucydides, a well-known Greek historian, criticised democracy by opining that democratic governments failed miserably “in the search for the truth.\" He believed that democracies produced demagogues who could sway public opinion with their rhetoric and rabble-rousing oratory skills, imposing their own interpretations of the truth on the masses. He further argued that this led to a failure..."
  },
  {
    "headline": "Indian Penal Code And The Rainbow Community",
    "data": "As far as history can remember, the rainbow community has experienced persecution and atrocities. In fact, in paragraph number twenty of Navtej Singh Johar vs. Union of India the Supreme Court of India opined as follows: “History owes an apology to the members of this community and their families, for the delay in providing redressal for the ignominy and ostracism that they..."
  },
  {
    "headline": "CCI Not In Favour Of Most-Favoured Nation Clauses: A Case For Intermediation Platforms",
    "data": "In the last year, the Competition Commission of India (“CCI”) came down heavily on the digital sector, with it passing orders against Google, MakeMyTrip and OYO and imposing hefty fines on them. In addition to this, the parliamentary panel in one of its reports has also proposed bringing in a Digital Competition Act, an ex-ante framework, in order to regulate the..."
  },
  {
    "headline": "Battle Between “Non –Obstante Clauses”",
    "data": "As commercial transactions become progressively complex each passing day, interplay amongst various statues has become part and parcel of such transactions, including any litigation born out of such transactions. Parties and courts should be mindful in interpretating various laws and regulations especially in situations wherein the relevant subject matter falls into the purview..."
  },
  {
    "headline": "Rethinking Marketing For Lawyers In Modern India",
    "data": "Lawyers enrolled in India are not permitted to market their work. It is prohibited by the Bar Council of India Rules[1] as well as the Advocates Act, 1961[2]. This ban originated in Victorian England and has remained till date. Its basis lies in Indian social construct of ethics and morals which requires abstaining from promotion of work, an aspect that used to resonate with the UK..."
  },
  {
    "headline": "Supreme Court Collegium’s Landmark Reiterations Show It Is No Longer Pusillanimous",
    "data": "On Thursday, the Supreme Court’s three-member Collegium - comprising the Chief Justice of India, D.Y.Chandrachud and Justices Sanjay Kishan Kaul and K.M.Joseph - responsible for recommending suitable names for elevation as the High Court Judges, reiterated certain names recommended by it earlier, for elevation to various High Courts. Reiteration of a recommendation by the Collegium..."
  },
  {
    "headline": "Infrequent Use of Basic Structure Doctrine By The Courts Makes Fears Of Its Critics Misplaced",
    "data": "The Vice President, Jagdeep Dhankhar’s address at the inauguration of the 83rd All India Conference of Presiding Officers in Jaipur on January 11 appears to have drawn more attention than it deserved because of its timing. In his address, Dhankhar referred to the ‘basic structure’ five times. First, he said that ‘the basic’ of any ‘basic structure’ has to be the..."
  },
  {
    "headline": "Why Vice President Dhankhar Is Wrong In Attacking The Judiciary",
    "data": "When the speaker of the Lok Sabha and the Chairman of the Rajya Sabha initiate a debate at the all-India presiding officers conference on the role of the judiciary, the country must wake up. Vice-President Jagdeep Dhankhar characterised the Supreme Court judgment on the National Judicial Appointments Commission (NJAC) Act as “a glaring instance of severe compromise of parliamentary..."
  },
  {
    "headline": "IBC - When Does Limitation Begin To Run? Analysing SC Judgment In \"V.Nagarajan vs. SKS Ispat\"",
    "data": "V.Nagarajan vs. SKS Ispat[2] is a much-misunderstood case. The National Company Law Appellate Tribunal (NCLAT), while dealing with appeals under the Insolvency & Bankruptcy Code, 2016 (“IBC”), has been dismissing many as being barred by the statute of Limitation. NCLAT cites Nagarajan to conclude it has no power to condone delay for any period over and above 15 days after..."
  },
  {
    "headline": "Interpretation Of Wills In India: A Testament Of Intentional Fallacy",
    "data": "Wills are not merely a legal document of division of property among beneficiaries, it is a writer’s dying declaration of love and commitment towards safeguarding the future of its beneficiaries. Freedom of testation is an emblem of personal freedom of the testator[1]; it protects the intention of the testator to choose the persons and properties it chooses to devolve..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "VRK- The Legendary Icon",
    "data": "This is an article which I had made available in the beginning of the year 2018 to a self-proclaimed fan of Justice V. R. Krishna Iyer. But, I doubt whether this article had seen the light of the day. Hence, I am presenting this to live law. My humble endeavour in this article is to highlight a couple of observations (not much popularised) made by late Justice V. R. Krisha..."
  },
  {
    "headline": "As Government Seeks A Role In The Collegium’s Process Of Recommending Potential Judges, It May Dilute Judicial Primacy",
    "data": "Reports in media on Monday suggest that the Union Law Minister, Kiren Rijiju has written to the Chief Justice of India, D.Y.Chandrachud suggesting that a search committee be set up to shortlist potential names for High Court and Supreme Court Judges, and such a committee could include a government nominee as well. The idea of a “search committee” or “evaluation committee”..."
  },
  {
    "headline": "Courts In Rajasthan To Continue Restrictive Functioning Until Further Orders [Read Notification]",
    "data": "In view of subsistence of the nationwide lockdown, the Rajasthan High Court has decided to continue restrictive functioning, both in the High Court as well as in the Subordinate courts, until further orders. It is intimated that the Benches will function between 08:30 AM and 12:30 PM. with half an hour break from 10:00 AM to 10:30 AM. Special Courts/Tribunals will also function between..."
  },
  {
    "headline": "Nani Palkhivala and the Basic Structure",
    "data": "“Freedom is not something that you can inherit in your bloodstream… You have to fight for it, cherish it, preserve it all the time.” - Nani Palkhivala The evolution of the basic structure doctrine would only be complete with the phenomenon of Nani Palkhivala. Born 103 years ago to the day on the 16th of January, Palkhivala would be one of our country's..."
  },
  {
    "headline": "Basic Structure - Kesavananda Returns ?",
    "data": "Last September I was invited by NALSAR University students to visit their campus for a talk. While they wanted scholastic content high on the jurisprudence quotient, I was in a more playful mood. So the poor organizers must have raised an eyebrow when I made a strange request. I wanted 13 chairs on the stage. The second request must have cleared the mist. I demanded that name tags be made of..."
  },
  {
    "headline": "New Lessons From Navlakha’s Case: Why Some Usual Bail Conditions Need A Review?",
    "data": "The need to approach the Supreme Court to seek an exemption from the production of a solvency certificate to avail the house arrest granted to Gautam Navlakha is an expression of a deeper problem. Amongst the many conditions of house arrest permitted by the Supreme Court, there is a condition that requires him to submit a local surety of Rs 2 Lakhs. The order granting house arrest..."
  },
  {
    "headline": "Drafting Of An Arbitration Agreement – Key Checkpoints",
    "data": "The importance of well – drafted agreements cannot be overstated, more so in the case of Arbitration agreements which are often drafted without much thought and care, infamously referred to as mid – night clauses as they are often reviewed last moment before signing a contract. A one – size fits all approach can pose significant problems and increase time, cost and complexity of..."
  },
  {
    "headline": "Off The Cuff Remarks Damaging To The System",
    "data": "In the past few weeks there have been casual and uninformed remarks. The views and counter views about the system of appointment of judges and the working of the courts display emotion and lack of knowledge. It is inappropriate for persons in high offices to speak casually and out of context. The system of appointment of judges to the higher judiciary is a serious issue that calls..."
  },
  {
    "headline": "What If 'Basic Structure Doctrine' Is Not There & Parliament Has Absolute Supremacy?",
    "data": "Imagine if the Indian Parliament were to ban women and girls from primary and secondary school education, as well as higher education, restrict them from most forms of employment, or prohibit them from travelling without being accompanied by a male relative. This is the reality for half of the population in Afghanistan under the hard-line fundamentalist rule of the Taliban, which is taking..."
  },
  {
    "headline": "Deformity Relating To Age Of Child Under POCSO Act",
    "data": "Protection of Children from Sexual Offences Act, 2012 (hereinafter “the Act”) was enacted to protect children from sexual abuse and to provide a safe environment. The Act prescribed more severe punishment for sexual assaults committed against children than that was prescribed in Indian Penal Code, 1860, and it also provided child-friendly procedures regarding the proceedings of..."
  },
  {
    "headline": "Will Of The People; India A Constitutional Democracy Not A Majoritarian Democracy",
    "data": "Much has been said in recent times about the striking down by the Supreme Court of the constitutional amendment introducing the National Judicial Appointments Commission (NJAC). As is well known, the Supreme Court struck down the constitutional amendment on the ground that it impinged on the independence of the judiciary, which is a basic feature of our Constitution. The judgement has..."
  },
  {
    "headline": "Evolution Of The Live-In Relationship In India Vis-A-Vis Personal Law",
    "data": "Tradition, convention, custom- these words have a tight grip over human society. Most of us prefer the comfort of history over the uncertainty of the future. For this reason, we often resist or even fear the idea of change. This opposition to change is especially prominent in Indian society, which values its attachment to generational customs. One of the most prominent of these traditions..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Sharad Yadav’s Legal Legacy",
    "data": "The former Janata Dal (U) chief, Sharad Yadav, who passed away on Thursday, will be remembered for crucial legal battles he fought towards the end of his long political career - one challenging his disqualification from the Rajya Sabha, and the other challenging the Government’s order to vacate his official accommodation in New Delhi, allotted to him while he was a Member..."
  },
  {
    "headline": "Courts In Rajasthan To Continue Restrictive Functioning Until Further Orders [Read Notification]",
    "data": "In view of subsistence of the nationwide lockdown, the Rajasthan High Court has decided to continue restrictive functioning, both in the High Court as well as in the Subordinate courts, until further orders. It is intimated that the Benches will function between 08:30 AM and 12:30 PM. with half an hour break from 10:00 AM to 10:30 AM. Special Courts/Tribunals will also function between..."
  },
  {
    "headline": "Concept Of Plea Bargaining",
    "data": "The Supreme court recently issued guidelines on disposing of cases through Plea Bargaining in an attempt to explore options for popularizing the very concept. However, it has once again started the eternal debate among legal scholars surrounding its fairness and constitutionality. To begin with, Plea Bargaining can be defined as the system of negotiating an agreement between..."
  },
  {
    "headline": "5th Anniversary of  Supreme Court Judges’ Press Conference: What Has Changed and What Has Not?",
    "data": "The fifth anniversary of the ‘historical’ press conference by four Supreme Court Judges - held on January 12, 2018 in New Delhi- was yesterday. Those who have been witnesses to it within and outside the Court have moved on with their responsibilities considering it perhaps as a one-off event,which had tarnished the image of the Supreme Court for a brief period.The 2018 press..."
  },
  {
    "headline": "Law & Custodial Death",
    "data": "\"One of the worst crimes in a civilized society under the Rule of Law is perhaps the death in custody. The Constitution's inherent rights, outlined in Articles 21 and 22(1), must be diligently and fiercely preserved. The right to live with dignity has been interpreted to include \"life or personal liberty.\" As a result, it would also include a prohibition on torture and other forms..."
  },
  {
    "headline": "Lack Of Substance Marks The Ongoing Tussle Between The Executive And The Judiciary",
    "data": "The ongoing turf battle between the Union Government and the Supreme Court’s Collegium is getting curiouser and curiouser. What initially appeared to be a contest for primacy over judicial appointments is now turning out to be an open display of discord between the Constitutional functionaries. While there should be no frequent public exhibition of bonhomie between the members of..."
  },
  {
    "headline": "As The Bengaluru Police Seeks Disclosure Of A Journalist’s Source, The Legal Position In India Leans In Favour Of Its Protection",
    "data": "ON January 5, the Bengaluru Police issued a notice to founder and editor of news portal, The File, G.Mahantesh, in connection with a case pertaining to an e-office file noting of the Karnataka Education Department which the portal published. The portal had done a story on the basis of the leak of the file noting in November 2022. The Bengaluru Cybercrime Police, acting on a..."
  },
  {
    "headline": "‘Some’ Defendants Ex Parte: A Procedural Saga Of Order IX Rule 11",
    "data": "As a rule of procedure, if the defendant does not appear on the day fixed for hearing, the court can order to proceed ex parte. In other words, the trial will continue on merits at the option of the plaintiff even though there is no defendant to put his defence. This is the scenario when in a suit there is only one defendant. Supposedly, there are more defendants than one and out..."
  },
  {
    "headline": "Pre–Nuptial Agreement",
    "data": "The concept of Pre – Nuptial agreement has a western origin since in countries like the United States of America, half of the marriages end up in divorce proceedings. The Pre – Nuptial Agreement steps out to be a precautionary measure safeguarding the assets of both the parties. The Pre Nuptial - Agreement is necessary in the modern period of time as the rate of breakdown of..."
  },
  {
    "headline": "A Feminist CJI And An Inclusive Judiciary",
    "data": "In today’s turbulent times where women’s rights are constantly questioned in places like Iran or in the USA where the Supreme Court itself sanctions a violation of women’s right to abortion, the role of the judiciary as the custodian of rights becomes important. When a woman steps into the halls of justice, she is met with stares and glares from the onlookers and faces harassment..."
  },
  {
    "headline": "Uttar Pradesh Population Policy 2021-30: A Feminist Exploration",
    "data": "The recent trend in government policies insinuates that despite the need for legislation does not seem apparent or sought by the targeted groups, the state acting under the paternalistic impression comes up with policies which are, sometimes, questioned by those groups themselves. In the long list of such legislative interventions, the latest entry is Uttar Pradesh’s Population..."
  },
  {
    "headline": "Law On Reels : \"Witness\" - A Hard-hitting Criticism Of Manual Scavenging",
    "data": "The recent Tamil film Witness, directed by Deepak Bhagvanth, examines the contours of manual scavenging in India. The movie revolves around a simple storyline of a mother - Indrani's quest for justice after her son Parthiban, who was forced into the septic tank, dies. The horrors of Manual Scavenging are counted throughout the film with caution not to hurt the manual scavengers'..."
  },
  {
    "headline": "Busting The Myth Behind 'Love Jihad' Laws Made By Eleven States |Column By CU Singh, Senior Advocate",
    "data": "The myth of ‘love jihad’, slayed repeatedly and supposedly laid to rest, rises yet again. A hydra-headed monster that’s revived time and again by a not-so-subtle conspiracy between Hindutva forces, the executive, and the judiciary, it is making yet another come back at the close of 2022.This time its a multi-pronged effort, starting in March with a new anti-conversion law in..."
  },
  {
    "headline": "Review: Report on the working of Wildlife Protection Act, 1972 by Criminal Justice and Police Accountability Project",
    "data": "In September 2022, the Government of India brought a group of eight big cats/cheetahs from Namibia to Kuno National Park in Madhya Pradesh. Amidst the celebrations of this project, what went unnoticed was the displacement of Adivasis and other similarly marginalized communities from Bagcha village, surrounding the park. Due to this ambitious project, the Sahariya Adviasis (a..."
  },
  {
    "headline": "Application Of Doctrine Of Repugnancy On Delegated Legislation",
    "data": "The relationship between the Parliament and the State Legislatures is demarcated in Chapter I of Part XI of the Constitution. Article 246, read with Schedule 7, deals with the subject matter of laws on which the Parliament and the State Legislatures can enact a law. Parliament and the State Legislatures are empowered to enact the laws on the subject matter provided in the Union List..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Renewable Energy Certificates – A New Dawn Or Just A False Positive?",
    "data": "The Renewable Energy market is booming because of its vitality and utility every which way be it ethically, morally or economically. India has been highly ambitious in declaring its Nationally Determined Contributions (NDCs) under the UNFCCC and Paris Agreement. It has been committed towards limiting its carbon footprint and switching towards cleaner and greener sources of energy. India..."
  },
  {
    "headline": "Right To Shelter Can't Be Unconditionally Taken Away : How Supreme Court Stalled Unconstitutional Evictions In Haldwani",
    "data": "In India, the right to shelter has been one of the most controversial rights, because neither they are fully guaranteed nor the rehabilitation policies are very well implemented by the government. Right to shelter also serves as the basic unit of human settlements and as an Indicator of the duality of life of a city or a country's inhabitants. It reflects, among other things, the mobilization..."
  },
  {
    "headline": "Conflicting Judgements Of Coordinate Benches",
    "data": "This article deals with the following issues in relation to coordinate bench judgments: law in relation to the conflicting judgments passed by the coordinate benches;recourse available to the latter coordinate bench; andconundrum which a lower court faces when conflicting judgments of co-equal benches are relied upon by the litigants before a lower court. What Is A..."
  },
  {
    "headline": "Residential Status Of Firm And Company",
    "data": "The Income Tax Act, 1961 places a lot of importance on \"Residential Status\" because it has a significant impact on the calculation or ascertainment of tax liability. An Assessee is either (a) an Indian Resident or (b) not an Indian Resident.Individuals who are residents and HUFs may be either (a) Residents who are usual Residents or (b) Residents who are not usual Residents. Both Residents..."
  },
  {
    "headline": "The English-Driven, Exclusivist Nature Of The Common Law Admission Test (CLAT)",
    "data": "A position of power and privilege for an individual or institution tends to lend its own perspective of viewing the world. It is, more often than not, a tunnel vision which unquestioningly views the surrounding as ‘normal’ and ‘obvious’ and stays in the dark from recognizing the layers of inequality and oppression present within our society. The recently concluded Common..."
  },
  {
    "headline": "Institutional Arbitration – Breaking The Deadlock In Small-Value Lending Disputes",
    "data": "A commercial court in Delhi recently rejected an application to enforce an arbitral award due to unilateral appointment of the sole arbitrator in the dispute. For the uninitiated, arbitration is an out-of-court process where, after hearing the parties, the arbitrator renders the decision in the form of an arbitral award. Unilateral appointment is the appointment of an arbitrator by..."
  },
  {
    "headline": "Federal Disputes And Original Jurisdiction Of Supreme Court Of India",
    "data": "Federal polities or federal countries are ones which have different levels of State agencies (such as legislature, executive and judiciary). By levels what has to be understood is that there are different levels and authorities of governance at the federal/national, state and/or local levels.India is a federal (sometimes quasi-federal) country having governance/state authorities at..."
  },
  {
    "headline": "Year End Review : Supreme Court's Highs & Lows In 2022",
    "data": "Sixty two year old Mohammad Qamir, who had been languishing in a detention centre since 2015 after being caught up in the legal cobwebs relating to citizenship, got freedom only due to an innovative and proactive intervention made by the Supreme Court. Though born in India in 1959, he had gone to Pakistan as a child along with his mother in 1967 to meet his relatives. He later returned to..."
  },
  {
    "headline": "Shipping Industry – A Complex Saga",
    "data": "Taxability of shipping industry has always been tricky and complex saga comparing to other service industry. To understand the tax implication of Shipping Industry, it is pertinent to understand the revenue model of shipping industry.It is often seen that exporters have approached Freight Forwarding Agency or Shipping Agency to move their goods either from their place of business or from Port..."
  },
  {
    "headline": "Simplification Of Voluntary Liquidation In India",
    "data": "Before the introduction of Insolvency and Bankruptcy Code (“IBC”) in 2016, there were multiple overlapping statutes to govern the insolvency proceedings like Sick Industrial Companies, Act, 1985, Provincial Insolvency Act, 1920, Code of Civil Procedure, 1908, and SARFAESI Act, 2002, all these legislations apparently failed to address the bankruptcy issues. So, the Government of India in..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Toying With Human Rights – On Genocides, Massacres And Riots",
    "data": "In the words of Voltaire, those who can make you believe absurdities; can just as easily make you commit atrocities. This phrase holds a significant amount of truth about what goes on behind the smokescreen of genocides, massacres and riots. On the face of it, these mass atrocities appear to be the consequences of an irretrievable breakdown of dialogue between groups differing on matters..."
  },
  {
    "headline": "Same Sex Marriage:The Current Conflict And The Way Forward",
    "data": "There is again a field ready for a confrontation between the government and the LGBTQIA+community as four gay couples have petitioned India's Supreme Court to allow same-sex marriages.The Supreme Court has given the government until January 6,2023 to respond. This action of the Supreme Court was followed by a vitriolicre mark from a member of parliament, Sushil Modi, who claimed that two..."
  },
  {
    "headline": "Claim For An Agreed Sum Vis-À-Vis A Claim For Damages",
    "data": "One of the most common remedies for refusal or failure of a party toperform its part of the promise is an action for claim of damages. These damagescan be unliquidated or liquidated. The law as enunciated by courts in Indiastipulates that even when a contract provides for liquidated damages, theinjured party has to prove its loss and can claim damages corresponding to theactual loss caused to..."
  },
  {
    "headline": "Guidelines On Sexual Assault Cases: Roles And Responsibilities Of Police Officials And Other Stakeholders",
    "data": "Given rising instances of sexual assault, the importance of taking drastic measures to curb the menace of sexual violence cannot be gainsaid. Apparently, there are laws that abjure the evil and attempt to rid the society of its demonic presence. Yet, sexual violence has escalated leaps and bounds into an epidemic that State now has little control over. To speak of the..."
  },
  {
    "headline": "Personality Rights: Interpretation And Scope",
    "data": "When Amitabh Bachchan got rejected as a radio presenter for his baritone, little did he know that several years down the line he would be in the Courts seeking protection from the rampant commercial use of the same much-admired voice. Not only is the anecdote an inspiration for many, but also, it brings to the fore a legal concept of great significance in the current times i.e. the..."
  },
  {
    "headline": "The New Legal Framework For Telecommunications: A Tool For Legal Regulation Or Public Surveillance?",
    "data": "On September 21, 2022, the Department of Telecommunications initiated public consultations on a proposed new legal framework for telecommunications. The Draft IndianTelecommunications Bill, 2022 (hereinafter, Draft ITB), is one of three proposed laws, collectively forming a pioneering scheme aimed at modernizing the archaic laws governing telecommunications and IT-related matters. The..."
  },
  {
    "headline": "Supreme Court Ignored Binding Precedents While Dismissing Bilkis Bano's Review Petition",
    "data": "The Supreme Court has dismissed the petition filed by Bilkis Bano seeking review of the judgment which allowed the Gujarat Government to decide the remission of eleven convicts who were sentenced to life for gangrape and murder of her family members during the 2002 communal riots.In a two-page order having no discussion or reasons, a bench comprising Justices Ajay Rastogi and Vikram Nath..."
  },
  {
    "headline": "GST On Sale Of Not Readily Realizable Assets In Liquidation Under IBC",
    "data": "Under regulation 37A of the Insolvency and Bankruptcy Board of India (Liquidation Process) Regulations, 2016 permits a Liquidator to assign or transfer a 'not readily realizable asset' (\"NRRA\") through a transparent process, (in consultation with the stakeholders' consultation committee) for a consideration to any person, who is eligible to submit a resolution plan for insolvency..."
  },
  {
    "headline": "Criminal Procedure Identification Act, 2022",
    "data": "The recently enacted Criminal Identification Act, 2022 has spurred a lot of protests among human rights activists. This law replaces the colonial Identification of Prisoners Act, 1920 and authorizes the executive to take measurements of convicts and other persons for the purpose of identification and investigation in criminal matters. It also authorizes the preservation of records and data...."
  },
  {
    "headline": "The Digital Data Protection Bill, 2022 And The Concerns Associated",
    "data": "Center's Ministry of Electronics and Information Technology (MeitY) recently tabled another version of the data protection bill called the Digital Data Protection Bill, 2022. This is the fourth instance when the Center presented a bill on data protection. The Supreme Court, in Justice K.S. Puttaswamy (Retd.) &Another vs. Union of India & Others, 2017, held that the right to privacy..."
  },
  {
    "headline": "Victim Participation In Criminal Justice System: An Indian Perspective",
    "data": "The crime victims' rights movement advocates for the rights of the victims of crime in criminal justice process. The concern for victim's rights had long been subdued. Eventually over a period, the victims' rights have become a focal point of the discussion. Starting from the point when an offence is reported to the investigating agency, till the stage of filing of charges and..."
  },
  {
    "headline": "Interpreting MTP Act From A Pro Choice Perspective",
    "data": "The debate on right of a woman to terminate pregnancy is divided between two main groups: pro-life and pro-choice. Attempt here is to examine development of law on the subject in India from a pro-choice perspective. Medical Termination of Pregnancy Act, 1971 (\"the MTP Act\") that governs the field in India aimed to address the issue of illegal abortions resulting in risks to life of..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "'Some Files Approved Fast, Some Kept Pending' : A Look At The Time Taken By Centre In Accepting Different Collegium Recommendations",
    "data": "Some recommendations are approved fast, but some others are kept pending for months, observed the Supreme Court recently while hearing a case filed against the Union Government for delaying approval for collegium proposals.There is no definite time-line set for the Centre to decide on collegium proposals, except in respect to names reiterated by the collegium as High Court judges, where there..."
  },
  {
    "headline": "Some Suggestions To Improve The Collegium System of Appointments",
    "data": "We are back to square one upon Supreme Court of India striking down 99th Constitutional Amendment Act which (brought into force w.e.f. 13/4/2015) which inserted Articles 124A,124B,124C in the Constitution of India and made corresponding changes in the Articles 124 and 217, 222. [Please refer to SCORA vs. UOI (2016) 5 SCC 1] In view of the aforesaid development, the collegium..."
  },
  {
    "headline": "Nani Palkhivala-The Gentle Colossus",
    "data": "December 11 marks the 20th anniversary of the passing of the one and only Nani Palkhivala. It is appropriate to remember him and light his memory on this occasion. Lawyer, jurist, expert in constitutional law, public finance and taxation, educationist, diplomat and statesman, Nanabhoy Ardeshir Palkhivala was all this and more. His was a multi-splendoured life marked by integrity..."
  },
  {
    "headline": "Justice Krishna Iyer- A Tribute",
    "data": "If greatness consists in the combination of character and intellect and is to be judged by the lasting value of work done and the impact it has had on men and matters, Justice Vaidyanathapuram Rama Ayyar Krishna Iyer was amongst the greatest. It is given to very few to be a legend in one's own life time and earn universal admiration, affection and reverence. A multi-faceted..."
  },
  {
    "headline": "Objection Milord!",
    "data": "Skirmishes between the Court on the one hand and the Executive or the Legislature on the other hand are not unknown. The Judiciary is often considered the custodian of the Constitution – to the protest of the elected. Scholars, some scholarly politicians and most politicians have termed the power of the judicial organ as the \"tyranny of the unelected\". Yet, over the years, history..."
  },
  {
    "headline": "An Open Letter To The Law Minister: The Origin And Not An Unqualified Rationale Of The Collegium System Of Appointments",
    "data": "Dear Sir, This is with regard to your observation that the collegium system of appointments is alien to the Indian Constitution. Like all constitutions across the world, not everything is written in the constitution. And, not everything written in the Constitution is immutable. Our Constitution provided for nebulously \"consultation\" with the Chief Justice of India, for..."
  },
  {
    "headline": "An Act Of Judicial Indiscipline",
    "data": "Occasionally, the outcome of the judicial process is shocking. One of them is the recent order of the CentralInformation Commission making remarks about an earlier Supreme Court judgement. I feel those remarks amount to a serious judicial indiscipline. The issue before the Commission was about the disclosure of information relating to honorarium (salary) payable to the Imams in..."
  },
  {
    "headline": "Maintaining Equality In Claiming Maintenance",
    "data": "Recently, the Supreme Court of India has given yet another decision explaining the scope of Section 125 of the Code of Criminal Procedure, 1973 ('the Code') contained in Chapter IX,[1] adding to a legion of cases doing the same. Though, as the name suggests, the Code is by and large a procedural enactment. Section 125 is one of the exceptions that creates a substantive right for..."
  },
  {
    "headline": "Arbitrator's Fee ; An Analysis Of Indian And International Laws",
    "data": "Arbitration, Mediation and Conciliationare alternate dispute resolution mechanisms which are preferred over litigation for they are cost effective and time saving. Keeping in mind the high pendency of cases, arbitration and mediation are encouraged by the judiciary as it shares the burden of the courts in winding up the matter in a time-bound manner. The bench of the Tribunal comprises..."
  },
  {
    "headline": "Glaring Flaws In Provisions Of Foster Care For Adoptable Children",
    "data": "A combined reading of the Juvenile Justice (Care & Protection of Children) Act 2015 as amended by the Juvenile Justice (Care and protection of Children) Amendment Act, 2021 (JJ Act), Juvenile Justice Model Rules 2016 as amended by the Juvenile Justice (Care and Protection of Children) Model Amendment Rules 2022 (JJ Model Rules) and Adoption Regulations 2022 (AR 2022) reveals..."
  },
  {
    "headline": "Draft Data Protection Bill Is A Common Person's Delight; Still Trows Up More Confusing Questions",
    "data": "All must be familiar with the timeline leading up to the new draft Digital Personal Data Protection Bill, released last week for public comments. Its roots can be traced to the Supreme Court's Puttaswamy judgment which exhorted for a data protection law for the country in the light of the iteration of privacy as a fundamental right. Then there was the Srikrishna Committee Report which..."
  },
  {
    "headline": "Beds Are What Drug Addicts Need, Not Prison Bars",
    "data": "Understanding how drug addiction crept into the region of heaven where people are thought to be living in peace—where they are supposed to be in peace—and whether punishment is the only effective way to stop this menace are crucial to combating the \"Drug Menace\" as a major threat to life and young lives. The drug problem in J&K is caused by a number of external and internal..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Social Context Adjudication: 'A Tool That Can Be Used By The District Judiciary To Provide Social Justice Without Writs And PILs'",
    "data": "The 'Preambular promises' of justice, liberty, equality and fraternity give the blue print of the type of society which 'We the people of India' resolved to give to ourselves. The Constitution of India provides a roadmap by weaving a pattern of rights and duties for establishing an egalitarian society based on the principles of fraternity and social justice. When India..."
  },
  {
    "headline": "Crimes Against Women: Eyes Of The World Are On India",
    "data": "On November 10, 2022, India's track record on human rights was peer reviewed at the 41st session of the Universal Periodic Review (UPR) Working Group at the United Nations Human Rights Council. While various issues related to civil and political rights, as well as economic and social rights were highlighted during the session, a running theme across the entire session was the issue..."
  },
  {
    "headline": "Offline Personal Data Not Within The Purview Of The Digital Personal Data Protection Bill, 2022",
    "data": "The draft digital personal data protection bill, 2022 was released on 18th November. The bill carries some drawbacks despite taking a lot of time for its finalization. One of those drawbacks is the ignorance of offline consumer and their rights. Section 4 (3) (b) of the draft digital personal data protection bill, 2022 states that the Act shall not apply to offline personal data. In..."
  },
  {
    "headline": "Rights Of Rape Victims",
    "data": "Rape is a stigma which exists in the society from a long time. Rape in India is a cognizable offence. Section 375(1) of Indian Penal Code defines rape as sexual intercourse with a woman without her consent, it amounts to rape. As there ports of the police in the national capital Delhi is that there's an increaseof 21.6% in rape cases registered in 2021 as compared to the 1618 cases in..."
  },
  {
    "headline": "Federalism Under Crisis: Unveiling The Constitutional Aspirations On Higher Education",
    "data": "During my tenure in the Indian Parliament one of the most exciting experiences was when, I had objected the introduction of a legislative bill which intended to incorporate a University in Budhalkand. The objection was based on the legislative competency of the Parliament to incorporate a university in a state. A cursory glance, into the provisions of our Constitution reveals that..."
  },
  {
    "headline": "\"Tofan Singh's Case\" Opens Up New Horizons In The Law Of \"Confessions\" In Criminal Trials",
    "data": "(This is the text of a webinar lecture which the author had made in a lawyers' collective.) I begin this lecture with my usual caveat that I am not an expert in criminal law. I am only a \"facilitator\" who is willing to share his experience and knowledge with you in the expectation of learning a lot from you in return. Even at the december of my life, I have no roses to offer and..."
  },
  {
    "headline": "Pendency Issue In Indian Courts Can Be Resolved By Increasing Judicial Strength By 20% | Column",
    "data": "During an interview with Indian Express reported on 9 November 2022 Chief Justice of India Justice DY Chandrachud said: \"There are some key areas which need to be attended to. First and foremost, the unfilled posts in judiciary. The need to fill up all posts in the judiciary, beginning with the district judiciary, high courts and, ultimately, the Supreme Court.\" The CJI has identified..."
  },
  {
    "headline": "Regulation Of Online Bond Platforms (\"OBP\")",
    "data": "Under the Indian Companies Act, 2013, a public company can issue debt instruments either through a public issue or private placement[1]. While public issues are done on the stock exchanges, private placements are done on electronic book provider platforms (\"EBP\"). Over recent years, the issue of debt securities through private platforms on the EBP have grown in leaps and bounds. To put..."
  },
  {
    "headline": "Need To Review The Present System Of Transfer Of High Court Judges",
    "data": "In view of the recent recommendation of the Supreme Court Collegium to transfer Justice Nikhil S. Kariel from his parent High Court, i.e., from High Court of Gujarat to the High Court of Patna and also recommendation to transfer Justice A. Abhishek Reddy from his parent High Court, i.e., from High Court of Telangana to the High Court of Patna and the another recommendation to transfer..."
  },
  {
    "headline": "Blurred Lines: The Impact Of Covid-19 On The Rule Of Law",
    "data": "The onset of the Covid-19 pandemic has had multifarious effects on the laws of governance and the concept of \"Rule of Law\" across jurisdictions. Governments found themselves in precarious positions where they had to take immediate, unprecedented actions, the ramifications of which became a matter of life and death for millions of people. This resulted in ordinances and..."
  },
  {
    "headline": "Effects Of Non- Registration Of Trademarks",
    "data": "A trademark means a brand, label, name, signature, word, letter, logo, numeral, shape of goods, packaging or combination of colours, capable of distinguishing the goods and services of a person from those of others, as per section 2(zb) r/w section 2(m) of the Trade Marks Act, 1999 (\"Act\"). The proprietor of a trademark invests a considerable amount of time, money and effort to build..."
  },
  {
    "headline": "Private Defence In The Context Of Partner Violence : When Jayabharathi Discovers The Fighter In Her | Law On Reels",
    "data": "Jayabharathi in the Malayalam movie \"Jaya Jaya Jaya Jaya He\", fondly called Jaya is an ordinary next door girl, short and lean in stature from a very humble background. The Jaya, the author refers to is the character from the recent Malayalam movie 'Jaya Jaya Jaya Jaya Hey'. Jaya like many amongst us was also indoctrinated to be less ambitious, tutored to adjust her needs and suppress..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Improved Collegium System: Task & Thoughts for 50th CJI",
    "data": "On November 09, Justice Dhananjaya Y Chandrachud took oath of Office of Chief Justice of India after almost four decades of his own experience as a seasoned lawyer and a distinguished Judge and Jurist and created a history of sorts to adorn the said highest office which his father Justice Y V Chandrachud occupied for long seven years earlier in 1970s.The expectations and requirements of..."
  },
  {
    "headline": "Tin Musings",
    "data": " Crossing a milestone is often a joyous occasion to pause and ponder. It is one for me now!! I am going past the 10th milestone now in my resumed journey as a lawyer.This journey started in October 1973 as a young 22 year old first generation lawyer with a first-class first rank University law degree with great ambition and enthusiasm at Calicut, Kerala at the grassroot level. After..."
  },
  {
    "headline": "Why The Minority Judgment In The EWS Reservation Case Offers A Better View Under The Given Conditions?",
    "data": "Nothing occurs in a vacuum. Phenomena are to be understood in their contexts. Let us take the case of 103rd Constitutional amendment which introduced Articles 15(6) and 16 (6) to extend reservations to Economically Weaker Sections (EWS). Data revealed by the Labour Ministry for the year 2017-18 pegged unemployment rate in the country at 6.1%, highest in forty-five years according..."
  },
  {
    "headline": "Unfulfilled Vision And Lackadaisical Approach;Legal Aid Services And The Worrisome Statistics Of Pro Bono Aid In India",
    "data": "In 1952, the idea of Free and Accessible Legal Aid was taking its roots in the Indian policy with several conferences and meetings being held to deliberate the Future of Legal Aid framework, which would later on serve as a Path to Justice for the Poor and underprivileged sections of the Society. Furthermore, Article 39A of the Constitution of India reaffirms the stance of the Policymakers..."
  },
  {
    "headline": "Philately Vs. Antiquities & Art Treasures Act, 1972: The Question Of Antiquity",
    "data": "The High Court of Delhi recently delved into the aspect of classification of philatelic exhibits as \"antiquities\" within the meaning of the Antiquities and Art Treasures Act, 1972[1]. Philately is defined as the collection and study of postage and imprinted stamps[2]. \"Antiquities\" under the Antiquities and Art Treasures Act, 1972 is defined as any coin, sculpture, painting, epigraph..."
  },
  {
    "headline": "A Brief Parody",
    "data": "A recent amicus brief (which is a legal brief filed by an organization or individual not party to the case but provides additional or relevant information with a view to assist the Court) in the Supreme Court of the United States (SCOTUS) is making the rounds because of its hilarious but impactful writing. However, before indulging in the contents of the brief, we must know what gave..."
  },
  {
    "headline": "Chief Justice DY Chandrachud: Landmark Judgements, Constitutionalism, and Penchant for Reform",
    "data": "Justice D.Y. Chandrachud on Wednesday took on the mantle as the topmost judge of the country. All eyes remain focused on the Supreme Court as the true-blue liberal and progressive Judge started his two-year-long tenure as the Chief Justice of India this week. We take a look back at some of his most important judgements, both arising out of the High Courts where he served as a Judge for about..."
  },
  {
    "headline": "Definition Of Dispute Under Section 8 IBC: Whether The Plausible Contention Test Is Sufficient?",
    "data": "Under the incumbent Insolvency and Bankruptcy regime of India, it is prerequisite to send a demand notice to the Corporate Debtor before initiation of Corporate Insolvency Resolution Process. The very intent of this section is to terminate potential CIRP proceeding at its inception where the same is not called for. One such method to quash a potential CIRP at the inception is raising..."
  },
  {
    "headline": "Rights Of Homebuyers Under The Insolvency And Bankruptcy Code",
    "data": "Home Buyers Are Financial Creditors: Homebuyers are financial creditors under the Insolvency and Bankruptcy Code, 2016 ('IBC'). IBC defines two categories of creditors: financial creditors and operational creditors (section 5 (8) and 5 (20), IBC) Originally, homebuyers were not treated as financial creditors. Their status as operational creditors was also doubted. Homebuyers'..."
  },
  {
    "headline": "Short Tenure With Impactful Reforms : CJI UU Lalit Leaves A Positive Legacy",
    "data": "When Justice Uday Umesh Lalit assumed office as the 49th Chief Justice of India on August 27, many would have thought that his would be a sedate term. After all, how much can happen in a brief term of 74 days? But proving all such speculations wrong, CJI Lalit's term was marked with momentous and unexpected events which unfolded at a quick pace. For example, did anyone in their..."
  },
  {
    "headline": "Challenges Of Traditional Knowledge Products In GI Registration",
    "data": "Ultimately linked to information, traditional knowledge is the know-how, techniques, and practices that are created, maintained, and transferred from generation to generation inside a community; they frequently emerge as an integral part of its cultural and spiritual identity. The indigenous knowledge also includes the components of several traditional technologies used for sustenance,..."
  },
  {
    "headline": "Making UPI Viable For Both The Public And The Facilitators",
    "data": "Unified Payments System['UPI'] was launched by the National Payments Corporation of India ['NPCI'] with the aim of integrating the payment mechanisms of India. Since, its launch in 2016, digital transactions using UPI has increased significantly. As per RBI's annual reports, for the year of 2015, total digital payments for retail transactions amounted to Rs. 1.54 lakh crores. However,..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Governor's Gaffes",
    "data": "Certain recent statements of the Governor of Kerala have been startling. They smack of monarchial tendencies and are totally alien to our constitutional scheme. He has spoken of the withdrawal of his pleasure with regard to Cabinet Ministers. That gives the impression of all this being personal to him. The true position is wholly otherwise. The Constitution has adopted a form..."
  },
  {
    "headline": "Every Cheque Ever Issued In India Is A 'Security' Cheque | Column",
    "data": "\"A cheque issued as security pursuant to a financial transaction cannot be considered as a worthless piece of paper under every circumstance.\"Just because a cheque is issued as a security does not mean that it will not attract the offence as defined under Section 138 of the Negotiable Instruments Act, 1881 ('NI Act'). This position of law as enunciated by the Apex Court in Sripati Singh v...."
  },
  {
    "headline": "Falling Groundwater Table and Rising Pollution; The Twisted Tale of The Punjab Preservation of Subsoil Water Act, 2009",
    "data": "During the Green Revolution, Punjab and Haryana switched from their conventional crops (maize, pearl millet, pulses, and oilseeds) to the wheat-paddy cropping cycle, which took place in the late 1970s and early 1980s. The country's food security was ensured by the shift in planting patterns, therefore neither the Center nor the two states expressed any worry about the sustainability of..."
  },
  {
    "headline": "The Paranoid Panopticon: Draft Indian Telecommunication Bill",
    "data": "The Department of Telecommunication on 21st September released the Draft Indian Telecommunication Bill with the objective of revamping the legal framework governing the telecom sector. While the Draft tries to present a wholly redefined framework, yet it miserably fails to provide a solution to existing problems plaguing the current regulatory framework and consists of provisions which..."
  },
  {
    "headline": "A Liberal Chief Justice During A Majoritarian Rule : Challenges Before Justice DY Chandrachud As CJI",
    "data": "Chief Justice of India-designate Justice Dhananjaya Y Chandrachud passionately champions the vision of a \"transformative Constitution\" that attempts a \"radical transformation of a society which is based on caste and patriarchy\". His judgment in Navtej Johar vs Union of India (which decriminalized consensual adult homosexuality) described the Indian Constitution as \"a great social document,..."
  },
  {
    "headline": "Food Advertising Regulation And Consumer Protection In India",
    "data": "Advertising is the promotion of a product to a viewership to attract engagement and sale of a product, and has an impact on the interests of consumers. Regulation of food advertising methodologies is needed to ensure that the advertising strategies used are legitimate, and ethically express the details pertaining to the product, thus protecting the interests of consumers. Though there..."
  },
  {
    "headline": "Metaverse As Workplace: Employment Issues",
    "data": "The way we work has undoubtedly changed, initiated first by technological developments and later by the COVID-19 pandemic. Hybrid offices have increased the use of virtual modes of working.[1] Enterprises have taken note of these developments and begun looking towards the next destination – the Metaverse. Metaverse refers to alternate digital reality, comprising a network of..."
  },
  {
    "headline": "Law on Reels -Review Of Netflix's 'The Playlist' And Spotify's Legal Conundrums",
    "data": "''You can't use old laws for new times'' said the lawyer in the new Netflix series called 'The Playlist' which depicts the rise of the now well-known music streaming service Spotify. It has 6 episodes which are titled 'The Coder', 'The Industry', 'The Vision', 'The Artist', 'The Partner' and, of course, 'The Law'. In doing so, the series ensures that everybody involved in the inception of..."
  },
  {
    "headline": "Equitable Distribution Of Property On Divorce? An Answer In Article 15",
    "data": "Article 15 (3) of the Constitution of India enables the State to pass laws that equalizes rights and grants opportunities to women in every field of their lives. However, the lack of laws which provide for an equitable distribution of the properties of the spouses upon divorce, is a glaring shortfall by the State in its commitment to ensure substantive equality. The Law of..."
  },
  {
    "headline": "Confession & Section 25 Of Indian Evidence Act",
    "data": "Given the fact that voluntariness or consent of an individual is the fundamental prerequisite for giving testimony in court, it becomes imperative to ensure that the accused is not in an environment notorious for extorting statements while making a confession. The historical instances of attempts to secure confessions either by hook or crook display the alpha and omega of police..."
  },
  {
    "headline": "Pre-Institution Mediation Under Commercial Courts Act",
    "data": "A series of judgements since early 2021, culminating in the decision of the Supreme Court in M/s. Patil Automation Private Limited v Rakheja Engineers Private Limited (2022 LiveLaw (SC) 678 )have discussed the scope of section 12A of the Commercial Courts Act, 2015 (the Act), that prescribes mediation before commercial disputes are filed before the court. In August this year, the..."
  },
  {
    "headline": "Menstrual Leave: Still A Distant Dream?",
    "data": "'I wish I can be a man.' Zheng Qinwen, the Chinese Tennis Player said after losing out on her French Open Title because of Menstrual Cramp. These words are enough to depict a woman's pain and discomfort experienced during the menstrual cycle. However, the menstrual experience is different for different women. For some women, menstruation might not cause any discomfort but for others,..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "The Ghost Of Supersession",
    "data": "It was the late 2000s. On the speaker's podium at the Indian Law Institute was Mr. Somnath Chatterjee, an eminent Parliamentarian and the then distinguished Speaker of the Lok Sabha. The subject, as it often was, an incident which impacted judicial independence. Sitting and waiting for their turn to speak were the aging but mentally agile Justice Krishna Iyer and the sprightly Soli..."
  },
  {
    "headline": "Trial By Media",
    "data": "CONTENTS Table of citations i to vi Sl.No I N N E R T I T L E S Para. Nos Page. Nos A Introduction 1 1 B The \"fourth estate\" and the need, if any, for its empowerment 2 1 C ..."
  },
  {
    "headline": "Book Review- High and Law By Advocate Sanjay Pinto",
    "data": "The simplest man should be able to turn to law to understand what he can or cannot do as well as what someone else can or cannot do to him. Written in clear and crisp manner Sanjay Pinto's popular weekly column has regularly demystified the intricacies of law and elucidated it for that simple man – one who is confused with the legalese that would confront him were he to seek remedies..."
  },
  {
    "headline": "Mental Health & Insurance Law: Locating The Flawed Discrimination",
    "data": "World Mental Health Day 2022 falls on 10 October. A chance to \"rekindle our efforts to protect and improve mental health,\" says the World Health Organization (WHO). The COVID-19 Pandemic exacerbated the issue of mental health as a 25% increase in the prevalent anxiety and depression can be seen worldwide. According to WHO, despite the widespread mental health problem, the funding for..."
  },
  {
    "headline": "GN Saibaba Case : Questions Raised Regarding Supreme Court's Saturday Hearing",
    "data": "Lawyers groups are abuzz with discussions regarding the extraordinary special sitting held by the Supreme Court on Saturday to hear the petition filed by the State of Maharashtra against the discharge of Professor GN Saibaba and five others in a UAPA case.The tearing hurry with which the petition filed at 3.59 PM yesterday was listed for hearing on a non-working day, that too before a..."
  },
  {
    "headline": "A Greek Comedy And An Indian Tragedy; Marital Rape Exception Under The Indian Law Must Go",
    "data": "In Lysistrata, an ancient Greek comedy by Aristophanes, performed in Athens in 411 BCE, Lysistrata- the protagonist- convenes the womenfolk of Greece to discuss the plan to end the Peloponnesian War. Lysistrata exhorts the women to refuse to have sex with their husbands until a treaty of peace is signed. The Greek women pursued their resolve and were successful in their..."
  },
  {
    "headline": "Problems Of The Collegium",
    "data": "Some news and events this week are somewhat disconcerting and call for comments purely as a matter of principle, without any reference to or casting aspersions on the people involved. It is reported that a meeting of the Supreme Court collegium is not to be held and recommendations for appointments made when less than one month remains prior to the retirement of a Chief Justice...."
  },
  {
    "headline": "Dobbs And X: A Tale Of Two Abortion Judgments",
    "data": "Abortion has been an issue of great debate over several years. In India, unlike the United States, the legislature has sanctioned abortions under the Medical Termination of Pregnancy Act, 1971 – albeit with conditions. In America, however, the Supreme Court of the United States, in 1971, in the now overruled decision of Roe[1], found that the right of a woman to have an abortion..."
  },
  {
    "headline": "The Confusions Around Same Day Sentencing Law In Death Penalty Cases",
    "data": "On September 19th, 2022, a 3-judge bench of the Supreme Court referred certain issues of death penalty sentencing to a larger constitutional bench. One of these issues relates to the amount of time required to collect and present mitigation evidence at the stage of sentencing. This issue is particularly important because, as evidenced by Project 39A's study, sentencing persons to death..."
  },
  {
    "headline": "Supreme Court's Verdict On MTP Act Might Pave Way For Criminalization Of Marital Rape In India",
    "data": "India is one of the few countries in the world that is yet to criminalise martial rape. The issue has been the subject of much debate of late in a country whose courts have increasingly been delineating the right to individual autonomy as a right that is to be cherished and protected. Recently, the Delhi High Court attempted to provide clarity over the said controversy but the..."
  },
  {
    "headline": "The Constitutional Courts Cannot And Should Not Quash An \"FIR\" During The Investigation Stage",
    "data": "C O N T E N T S Parts I N N E R T I T L E S Para No: Page No: A Introduction List of verdicts which hold that FIR can be quashed - given 1 3 1 4 B Legal status of an FIR and who can give it. 4 5 C ..."
  },
  {
    "headline": "Justice Indira Banerjee: The Judge & Her Jurisprudence",
    "data": "On 23rd September 2022, Justice Indira Banerjee has bid adieu to the Supreme Court of India by taking retirement from judgeship. Her elevation to the Apex Court, in the year 2018, was phenomenal as it was the first time in the judicial history of India that the Supreme Court got three (3) women judges serving at a time (i.e. Justices R. Banumathi, Indu Malhotra & Indira..."
  },
  {
    "headline": "Evolving Jurisprudence Related To Priority Of Employees Provident Fund Dues Vis A Vis Dues Payable To Secured Creditors",
    "data": "Provident and Pension Fund dues payable under the Employees Provident Funds and Miscellaneous Provisions Act, 1952 ('EPF Act') have been given priority over all other debts of the Employer as per Section 11(2) of the EPF Act. Courts in India have historically given priority to dues under the EPF Act and payable to the Employees Provident Fund Organisation ('EPFO') over other debts of..."
  },
  {
    "headline": "",
    "data": ""
  },
  {
    "headline": "Digital Media Rights(DRM) - Analysis Of Copyright Law",
    "data": "The web's widespread use in the modern world has made it simple to share information. An inconsequential result of this is a change in reading patterns across the world. On one hand, any specific media can always be distributed and released publicly with barely any technical barriers and on the other, a visually impaired person is finding it more difficult to adapt to this change...."
  },
  {
    "headline": "Overseas Online Business And Territorial Jurisdiction In Trademarks Infringement Suits",
    "data": "An ex-parte interim injunction was granted, by Delhi High Court, in favour of Tata sons (Tata Sons Private Ltd v. Hakunamatata Tata Founders & Ors), restraining two companies registered in the UK and the USA from unauthorized use of the registered trademark 'TATA'. These foreign companies were marketing and trading online in digital tokens or cryptocurrencies through the..."
  },
  {
    "headline": "Colossal Delay Of 296 Days By NCLT In Approving Resolution Plan After Approval Of Resolution Plan By Committee Of Creditors In FY 2021-22",
    "data": "\"Judicial delay was one of the major reasons for the failure of the insolvency regime that was in effect prior to IBC. We cannot let the present insolvency regime meet the same fate.\" -Justice DY Chandrachud in Ebix v. Educompp, 2022 The Insolvency & Bankruptcy Code, 2016 (IBC/Code) was enacted by the Government of India to eliminate the delays in resolving insolvency and to..."
  },
  {
    "headline": "Moonlighting  And Restrictive  Covenants",
    "data": "Moonlighting refers to the practice of taking up additional jobs, without employers' knowledge. Shops and Establishment Act of various states and Factories Act, 1948 prohibits double employment. Employment contracts too restrain working in dual employment. As a professional, freelancer, stringer, retainer one can work for multiple clients, customers , however , as a full time..."
  },
  {
    "headline": "Forensic Evidence And Right To Privacy",
    "data": "The Indian Evidence Act, 1872 is one of the oldest legislations in our country. Although various amendments have been introduced, some provisions have become out-dated especially with the extensive involvement of forensic science. In the last two decades, there has been a drastic change in committing a criminal offence as well as its investigation. To keep pace with the development..."
  },
  {
    "headline": "Justice Indira Banerjee's Code (IBC) : Development Of IBC Jurisprudence",
    "data": "Justice Indira Banerjee has retired from the office of the Judge of the Supreme Court last week. She became the first lady judge to preside over a constitution bench. In her journey as a judge of the apex court of the country, she gave many landmark & important rulings. Apart from other subject matters, her contribution to the jurisprudence surrounding IBC shall be long remembered. Though..."
  },
  {
    "headline": "POCSO vs MTP Act : Concerns Raised About Mandatory Police Reporting Requirement In Teenage Pregnancies",
    "data": "The Delhi High Court on September 20 directed the Centre to ensure that a minor's pregnancy of nearly 20 weeks is terminated at All India Institute of Medical Sciences. Though the Medical Termination of Pregnancy Act [MTP] permits doctors to abort a pregnancy of less than 24 weeks without requiring a court order - if the conditions under the law and rules are met, the medicos in the case of..."
  },
  {
    "headline": "Analyzing The Applicability Of Section 48 Of The GVAT On The Frontier Of Section 53 Of IBC, 2016",
    "data": "Recently, in the case of State Tax Officer v. Rainbow Papers Ltd, 2022 SCC OnLine SC 1162, decided by a bench comprising Indira Banerjee and AS Bopanna, JJ has reversed the earlier order wherein it was held that Section 53 of Insolvency and Bankruptcy Code will prevail over GVAT Act as the first claim over the property of Corporate Debtor cannot be made by the Government. Section 48 of..."
  },
  {
    "headline": "Can CJI Lalit Change The Way Constitutional Benches Work?",
    "data": "Justice U.U. Lalit was appointed as 49th Chief Justice of India, on 27th of August 2022. A few days before his appointment his voice started to echo in the hallowed halls of the Supreme Court, with his determination to reform and aim to dispose of cases quickly. After taking over, Justice Lalit called a full court meeting which lasted for three and half hours. Every judge was heard..."
  },
  {
    "headline": "Demystifying The Effect Of Insolvency Proceedings In India On Arbitrations",
    "data": "Globalization has been accompanied by cross-border commercial disputes and arbitration has become the default setting for adjudication both nationally and globally.[1] This swing towards arbitration has prompted India to re-equip laws according to international standards. Concurrently, the government has introduced the Insolvency and Bankruptcy Code in 2016 [\"IBC\"] that has transformed..."
  }
]